[
{"international_classification": ["G01S19/00", "B60R21/34"], "us_classification": "", "reference": ["US6243644", "US7019669", "US7663505", "US7739006", "US8081087", "US8538675", "US20030191577"], "title": "Communication based vehicle-pedestrian collision warning system", "summary": "A system for detecting a pedestrian is provided. The system includes a base and a mast extending from the base, and a plurality of sensors mounted on the mast, the plurality of sensors for detecting objects and pedestrians within a predetermined range, and wherein the sensors include a GPS antenna, at least one camera, an alert mechanism, a radio with an integrated directional antenna, and a short range communication antenna. A path predicting circuit is in communication with a system vehicle and the pedestrian detection system. The path predicting circuit processes information from the system vehicle and pedestrian detection system to predict the path of the system vehicle and detected objects. The path predicting circuit is in communication with a path collision circuit and the predicted paths are mapped on the path collision circuit so as to determine if the system vehicle may possibly collide with a detected object.", "assignee": ["Raytheon Company, ", "Toyota Motor Engineering & Manufacturing North America, Inc."], "publication_date": "26 sept. 2013", "id": "US20130253816", "referenced_by": ["US20130120158"], "inventors": ["Lorenzo Caminiti, ", "Jeffrey Clark LOVELL, ", "James Joseph Richardson, ", "Christopher Thomas Higgins"]},
{"international_classification": ["B60T7/22"], "us_classification": "", "reference": ["US3810520", "US6267194", "US6474753", "US7018004", "US7975798", "US8146703", "US8180531", "US8185273", "US8191667", "US20020112912", "US20090038873", "US20100300794", "US20110264347", "US20110264348", "US20120004819", "US20120083983", "US20120265418"], "title": "Method and Device for Autonomous Braking of a Vehicle Following Collision", "summary": "A method of controlling a vehicle braking system, includes: (i) detecting whether a collision has occurred; (ii) detecting whether a predetermined condition follows the collision; (iii) determining whether a driver has applied the brakes; and (iv) when a driver has not applied the brakes, autonomously initiating braking.", "assignee": ["Ford Global Technologies, Llc"], "publication_date": "26 sept. 2013", "id": "US20130253792", "referenced_by": ["US8670915", "US20130238211"], "inventors": ["Hassen Hammoud, ", "Jainbo Lu, ", "Gilberto Burgio, ", "Todd N. Clark, ", "Otto Hofmann, ", "Mohsen Lakehal-ayat, ", "Shweta M. Farmer, ", "Jason Shomsky, ", "Roland Schaefer"]},
{"international_classification": ["G06F7/00"], "us_classification": "", "reference": ["US6038496", "US20020179355", "US20090072972"], "title": "Method for increasing the safety of a vehicle and central processing unit for a driver assistance system", "summary": "A method is provided for increasing the safety of a vehicle, a region about the vehicle being scanned and a distance between at least one location on the vehicle and a physical limit of this region is measured in at least one direction. Subsequently, it is checked whether the distance exceeds a specifiable threshold value and finally, a warning signal is output and/or the vehicle is braked, if the result of the checking is positive. Moreover, a central processing unit for a corresponding driver assistance system and a driver assistance system are provided.", "assignee": ["Meike Fehse"], "publication_date": "26 juil. 2012", "id": "US20120191315", "referenced_by": [], "inventors": ["Meike Fehse"]},
{"international_classification": ["G05D1/00"], "us_classification": "", "reference": ["US8521364", "US20030150661", "US20090187313", "US20090259365", "US20100235053", "US20110054739", "US20110057813", "US20110080304", "US20110128140", "US20110260887", "US20120072067", "US20120287279", "US20130038715"], "title": "Method for Assisting a Driver of a Motor Vehicle", "summary": "A method for assisting a driver of a vehicle in a driving maneuver in which the vehicle is guided automatically along a previously calculated trajectory, or the lateral guidance for travel along the trajectory is carried out automatically, and after the driving maneuver is completed, the steering of the vehicle is returned to the driver, information being provided to the driver concerning the vehicle's surroundings and suitable steering settings before and/or during the transfer of the steering to the driver. Also described is a device for carrying out the method, including a steering arrangement for steering the vehicle along a previously calculated trajectory as well as an output arrangement for outputting information concerning the vehicle's surroundings and suitable steering settings to the driver before and/or during the transfer of the steering to the driver.", "assignee": ["Volker NIEMZ, ", "Andreas Gruetzmann"], "publication_date": "18 juil. 2013", "id": "US20130184925", "referenced_by": ["US20120173068", "US20140070934"], "inventors": ["Volker NIEMZ, ", "Andreas Gruetzmann"]},
{"international_classification": ["G06N5/02", "G06F7/00", "B60K31/00"], "us_classification": "", "reference": ["US8340883", "US20040030499", "US20080097699", "US20090076702", "US20100017180", "US20100036578", "US20100207762", "US20110071964", "US20110246156", "US20120083960"], "title": "Method and system for predicting movement behavior of a target traffic object", "summary": "A method for computationally predicting future movement behaviors of at least one target object can have the steps of\n   producing sensor data by at least one sensor physically sensing the environment of a host vehicle, and computing a plurality of movement behavior alternatives of a target object sensed by the sensor(s).    ", "assignee": ["Honda Research Institute Europe Gmbh"], "publication_date": "28 fvr. 2013", "id": "US20130054106", "referenced_by": ["US8788134", "US20130211689"], "inventors": ["Jens SCHMDDERICH, ", "Sven Rebhan"]},
{"international_classification": ["G06K9/32", "G06K9/62", "G06K9/00", "G06K9/46", "G06F7/00"], "us_classification": "", "reference": ["US6269358", "US6782125", "US7062083", "US7065248", "US8762383", "US20010028739", "US20020122587", "US20030044062", "US20030126125", "US20080131004", "US20100135582", "US20120148118", "US20130282712"], "title": "Methods and apparatus for automated true object-based image analysis and retrieval", "summary": "An automated and extensible system for analysis and retrieval of images based on region-of-interest (ROI) analysis of one or more true objects depicted by an image is provided. The system uses an database that is a relational or analytical database containing searchable vectors that represent the images stored in a repository. Entries in the database are created by an image locator and ROI classifier working together to locate images within the repository and extract relevant information to be stored in the ROI database. The ROI classifier analyzes objects in an image to arrive at actual features of the true object. Graphical searches are performed by the collaborative workings of an image retrieval module, an image search requestor and an ROI query module. The image search requestor is an abstraction layer that translates user or agent search requests into the language understood by the ROI query.", "assignee": ["Google Inc."], "publication_date": "7 juin 2012", "id": "US20120140990", "referenced_by": ["US20120134583", "US20130101209"], "inventors": ["Jamie E. Retterath, ", "Robert A. Laumeyer"]},
{"international_classification": ["B60Q1/00"], "us_classification": "", "reference": ["US6262657", "US6353778", "US7123874", "US8577352", "US20100222976", "US20120092148", "US20120253552"], "title": "Methods, systems, and computer program products for managing operation of a portable electronic device", "summary": "Methods and systems are described for managing operation of a portable electronic device. Vehicle information, about an automotive vehicle, is received. Device information, about a portable electronic device configured to perform an operation, is received. An operator of the automotive vehicle is detected to be a user of the portable electronic device, based on the vehicle information and the device information. Operation information is sent, in response to detecting the operator is the user, to prevent the portable electronic device from performing the operation.", "assignee": ["Robert Paul Morris"], "publication_date": "16 aot 2012", "id": "US20120206254", "referenced_by": ["US20130052945"], "inventors": ["Robert Paul Morris"]},
{"international_classification": ["H01L29/66", "H01L21/02"], "us_classification": "", "reference": ["US7875485", "US20030062480", "US20040232337", "US20090140148", "US20090152466", "US20090207879", "US20100171190", "US20110049366"], "title": "Atomic Layer Deposition Strengthening Members and Method of Manufacture", "summary": "In one embodiment, a method of forming a semiconductor device includes providing a substrate, forming a sacrificial layer above the substrate layer, forming a first trench in the sacrificial layer, forming a first sidewall layer with a thickness of less than about 50 nm on a first sidewall of the first trench using atomic layer deposition (ALD), and removing the sacrificial layer.", "assignee": ["Robert Bosch Gmbh"], "publication_date": "12 sept. 2013", "id": "US20130234270", "referenced_by": ["US20140065803"], "inventors": ["Gary Yama, ", "Fabian Purkl, ", "Matthieu Liger, ", "Matthias Illing"]},
{"international_classification": ["G06F19/00"], "us_classification": "", "reference": ["US8068981", "US20040117113", "US20050060069", "US20050102098", "US20070005245", "US20070080829", "US20070179709", "US20080024284", "US20080027639", "US20080161987", "US20100023245", "US20100152950", "US20100254346", "US20100256903", "US20100267379", "US20100284384", "US20100303048", "US20100317420", "US20110029233", "US20110047338", "US20110066304", "US20110098877", "US20110112730", "US20110112908", "US20110130964", "US20110190972", "US20110202271", "US20110307139", "US20110310733", "US20110313663", "US20120010762", "US20120095641", "US20120139761", "US20120173530", "US20130282277", "US20130293394"], "title": "Method and apparatus for the classification of data", "summary": "A method for the classification of data includes receiving a first message that is a vehicle-to-vehicle or a vehicle-to-infrastructure message. The first message includes first mobility data of a vehicle. An expected route of the vehicle is determined based on the first mobility data. A second message that is a vehicle-to-vehicle or a vehicle-to-infrastructure message is received. The second message includes second mobility data of the vehicle. An actual route of the vehicle is determined based on the second mobility data. Whether the expected route deviates from the actual route by at least a predetermined threshold value is determined. If the expected route deviates from the actual route by at least the predetermined threshold value, a type of momentary driving maneuver of the vehicle is determined and the first mobility data and the second mobility data are classified on the basis of the type of momentary driving maneuver.", "assignee": ["GM Global Technology Operations LLC"], "publication_date": "15 nov. 2012", "id": "US20120290198", "referenced_by": [], "inventors": ["Jonas FIRL, ", "Hagen STUEBING"]},
{"international_classification": ["G06F17/00", "B60W50/08"], "us_classification": "", "reference": ["US20040020698", "US20050203685", "US20070203617", "US20070213905", "US20100280710"], "title": "Method for controlling a motor vehicle and device therefor", "summary": "A method for controlling a motor vehicle wherein the control is carried out with the participation of at least one driver assistance system. In order to simplify and/or differentiate the overriding of a driver assistance system, there is provision that the participation of at least part of the at least one driver assistance system in the control of the motor vehicle is switched off or changed by the driver activating an activation element which is provided in and/or on the motor vehicle and communicates with the at least one driver assistance system. A corresponding device is also described.", "assignee": ["Continental Teves Ag & Co. Ohg"], "publication_date": "6 oct. 2011", "id": "US20110245992", "referenced_by": ["US20110241850"], "inventors": ["Ulrich Sthlin, ", "Jrgen Diebold"]},
{"international_classification": ["G06K9/36"], "us_classification": "", "reference": ["US7512262", "US7570804", "US8634637", "US8644599", "US20130070052", "US20130083994", "US20130089269"], "title": "Semi-Global Stereo Correspondence Processing With Lossless Image Decomposition", "summary": "A method for disparity cost computation for a stereoscopic image is provided that includes computing path matching costs for external paths of at least some boundary pixels of a tile of a base image of the stereoscopic image, wherein a boundary pixel is a pixel at a boundary between the tile and a neighboring tile in the base image, storing the path matching costs for the external paths, computing path matching costs for pixels in the tile, wherein the stored path matching costs for the external paths of the boundary pixels are used in computing some of the path matching costs of some of the pixels in the tile, and computing aggregated disparity costs for the pixels in the tile, wherein the path matching costs computed for each pixel are used to compute the aggregated disparity costs for the pixel.", "assignee": ["Texas Instruments Incorporated"], "publication_date": "4 avr. 2013", "id": "US20130083994", "referenced_by": ["US20130083994"], "inventors": ["Jing-Fei Ren, ", "Manish Goel, ", "Branislav Kisacanin"]},
{"international_classification": ["H04N7/18"], "us_classification": "", "reference": ["US7124027", "US20020039187", "US20020047901", "US20020101360", "US20020154032", "US20040136568", "US20040207652", "US20040213463", "US20060216674", "US20070031006", "US20070115357", "US20070263096", "US20090295920"], "title": "Image acquisition system and method for distance determination using an image recording system", "summary": "A vehicle-based image acquisition system having an image sensor that has a characteristic curve assembled from linear segments. The system includes an arrangement for determining the distance of luminous objects imaged by the image sensor.", "assignee": ["Karsten Muehlmann, ", "Alexander Wuerz-Wessel"], "publication_date": "31 dc. 2009", "id": "US20090322872", "referenced_by": [], "inventors": ["Karsten Muehlmann, ", "Alexander Wuerz-Wessel"]},
{"international_classification": ["H04N7/18", "G06K9/00"], "us_classification": "", "reference": ["US6317057", "US6434256", "US6930593", "US8116523", "US8209123", "US20040042638", "US20100295668", "US20110216944"], "title": "Lane departure prevention support apparatus, method of displaying a lane boundary line and program", "summary": "A lane departure prevention support apparatus comprises: imaging means for capturing an image of a lane boundary line which defines a traveling lane; vehicle position detecting means for recognizing the lane boundary line in a recognition area of captured image data to detect a host vehicle position within the traveling lane in a width direction; assisting means for performing driver assist using the recognition result of the lane boundary line; displaying means for displaying the recognition result of the lane boundary line; and recognition result display controlling means for displaying an unrecognized lane boundary line according to the host vehicle position, if one of left and right white lines is not recognized, wherein a display of the unrecognized lane boundary line is not such a display which indicates that the lane boundary line is not recognized.", "assignee": ["Toyota Jidosha Kabushiki Kaisha"], "publication_date": "13 dc. 2012", "id": "US20120314055", "referenced_by": [], "inventors": ["Hiroaki Kataoka"]},
{"international_classification": ["G08G1/123"], "us_classification": "", "reference": ["US6289209", "US20060153123", "US20090117855", "US20100226291", "US20110026472"], "title": "Method for positioning and vehicle communication unit", "summary": "Methods and an appropriately setup communication unit for positioning in vehicle-to-surroundings communication are described, wherein the method involves a first sensor (S1) of a first communication subscriber using a transmission and reception unit to emit a challenge pulse, to which a transmission and reception unit of a second sensor (S2) of a second communication subscriber responds with a response pulse. The response pulse is received and evaluated by the first sensor (S1) and positioning is performed. In order to achieve reliable cooperative sensor communication, the transmission and reception units of the first and second sensors (S1, S2) use a frequency band (SCH2) which is reserved for vehicle-oriented safety applications.", "assignee": ["Continental Teves Ag & Co. Ohg"], "publication_date": "7 juin 2012", "id": "US20120139761", "referenced_by": ["US20120290198"], "inventors": ["Ulrich Sthlin, ", "Marc Menzel, ", "Stephan Zecha, ", "Oliver Scherf"]},
{"international_classification": ["G06F7/00", "G08B23/00", "B60T7/12"], "us_classification": "", "reference": ["US6256561", "US7620497", "US7893819", "US20050017857", "US20060152346", "US20070203617", "US20080023254"], "title": "Driver Assistance System and Method for Supporting the Driver of a Vehicle in Maintaining a Traffic Lane Limited by Traffic Lane Markings", "summary": "In a method and apparatus for assisting the driver of a vehicle in maintaining a traffic lane limited by traffic lane markings, the traffic lane markings and the position of the vehicle in the traffic lane are detected. Upon an actual or impending change of traffic lanes a lane change warning is output to the driver of the vehicle in a first step, and a course correcting actuating intervention counteracting the lane change is carried out in a second step. The actuating intervention is carried out only if the change of traffic lanes is impermissible due to the type of traffic lane marking to be crossed during the traffic lane change, or if the lane change is not possible without danger due to collision-endangering objects present on the side of the traffic lane.", "assignee": ["Daimler Ag"], "publication_date": "29 sept. 2011", "id": "US20110234390", "referenced_by": ["US8466807", "US20120306663"], "inventors": ["Bernd Danner, ", "Uli Kolbe, ", "Rainer Moebus, ", "Markus Raab, ", "Uwe Regensburger, ", "Reinhold Schoeb, ", "Ingo Dudeck, ", "Lars Dudeck, ", "Anke Dorle Dudeck, ", "Sven Gerhard Dudeck"]},
{"international_classification": ["G06F9/02", "G06K9/54", "G06F15/76", "G06F9/38"], "us_classification": "", "reference": ["US5329318", "US5442402", "US5645066", "US5724608", "US6459813", "US7003163", "US7509634", "US7760912", "US7796166", "US8139850", "US20090161950", "US20090295928", "US20100142846"], "title": "Image Processing Address Generator", "summary": "An image processing system including a vector processor and a memory adapted for attaching to the vector processor. The memory is adapted to store multiple image frames. The vector processor includes an address generator operatively attached to the memory to access the memory. The address generator is adapted for calculating addresses of the memory over the multiple image frames. The addresses may be calculated over the image frames based upon an image parameter. The image parameter may specify which of the image frames are processed simultaneously. A scalar processor may be attached to the vector processor. The scalar processor provides the image parameter(s) to the address generator for address calculation over the multiple image frames. An input register may be attached to the vector processor. The input register may be adapted to receive a very long instruction word (VLIW) instruction. The VLIW instruction may be configured to transfer only: (i) parameters for image processing calculations over the image frames by the ALU units and (ii) a single bit to the address generator.", "assignee": ["Yosef Kreinin, ", "Gil Dogon, ", "Emmanuel Sixsou, ", "Yosi Arbeli, ", "Mois Navon, ", "Roman Sajman"], "publication_date": "15 dc. 2011", "id": "US20110307684", "referenced_by": [], "inventors": ["Yosef Kreinin, ", "Gil Dogon, ", "Emmanuel Sixsou, ", "Yosi Arbeli, ", "Mois Navon, ", "Roman Sajman"]},
{"international_classification": ["B60Q1/00", "G06F7/00"], "us_classification": "", "reference": ["US20090058845", "US20100182140"], "title": "Driver assistance detection system", "summary": "A driver assistance detection system and method for determining levels of functionality of an interactive device in a vehicle are provided. The driver assistance detection system comprises a vision-based detection device, a processing device, and an interactive device. The vision-based detection device is configured to visually detect objects, recognize whether the object is an object of interest, and then obtain data regarding a status of the object. The processing device is configured to receive data from the vision-based detection device, run a set of instructions and switch the interactive device between a first mode and a second mode. The interactive device is configured to have at least two modes, wherein the second mode has reduced functionality relative to the first mode.", "assignee": ["Continental Automotive Systems, Inc."], "publication_date": "13 dc. 2012", "id": "US20120313770", "referenced_by": ["US20120313793", "US20130241747"], "inventors": ["David Zeiger, ", "Young Son"]},
{"international_classification": ["B64C13/46", "B60W40/08"], "us_classification": "", "reference": ["US3970840", "US4024651", "US5149023", "US5798695", "US6263997", "US6374163", "US6625530", "US6644600", "US6678567", "US6895357", "US7658349", "US7694913", "US7759894"], "title": "Contact detection", "summary": "The invention relates to a method for detecting a contact state between at least one driver/operator of a vehicle and a control input device designed to control the vehicle were a frequency spectrum is calculated from sensors detected movement signals based on which the contact state between the control input device and the driver/operator is determined.", "assignee": ["Max Abildgaard, ", "Robin Lantzsch, ", "Mario Muellhaeuser"], "publication_date": "3 nov. 2011", "id": "US20110266396", "referenced_by": [], "inventors": ["Max Abildgaard, ", "Robin Lantzsch, ", "Mario Muellhaeuser"]},
{"international_classification": ["G06F17/50"], "us_classification": "", "reference": [], "title": "Method and apparatus for current limit test for high power switching regulator", "summary": "A method can reuse at least one pin in demultiplexing (demuxing) a voltage from a pin. The method can be used to set an accurate current limit threshold in a design for test (DFT) phase and, thus, to accurately set a trimming code of a current limiter. The method uses the property that a power MOSFET has almost a same conductive resistance at a large drain current. Thus, the current limit threshold can be set according to an accurate drain-to-source voltage Vds at a small current sink that is less than a maximum current that ATE is able to provide. An accurate voltage Vds can be measured through Kelvin sensing drain and source pins of the power MOSFET, which are connected to a current sense circuit.", "assignee": ["Analog Devices Technology"], "publication_date": "18 sept. 2014", "id": "US20140282349", "referenced_by": [], "inventors": ["Roger Feng, ", "Junxiao Chen, ", "Bin Shao"]},
{"international_classification": ["B60R1/12", "G06F7/00"], "us_classification": "", "reference": ["US20020044065", "US20040150534"], "title": "Driver assistance system for a vehicle", "summary": "A driver assistance system for a vehicle includes a display screen disposed within an interior cabin of the vehicle and a camera disposed at the vehicle and having a rearward field of view. The display screen displays video information captured by the camera for assisting the driver during a reversing maneuver. When the vehicle is not executing a reversing maneuver, the information display screen is operable to display information wirelessly communicated to the vehicle from a remote communication system. The information from the remote communication system may include traffic information or traffic related information, such as traffic flow, congestion, stalled vehicle or accident information, alternate routes for the vehicle, and/or traffic information derived from sensors or signs positioned along the road that the vehicle is traveling or on other roads near or associated with that road. The remote communication system may include a highway/road management monitoring system.", "assignee": ["Donnelly Corporation"], "publication_date": "27 fvr. 2014", "id": "US20140058653", "referenced_by": ["US20110119614", "US20120200664"], "inventors": ["Kenneth Schofield, ", "Troy O. Cooprider"]},
{"international_classification": ["G05D1/00", "G08G1/0967"], "us_classification": "", "reference": ["US5889477", "US6012012", "US6150961", "US6151550", "US6178374", "US6317682", "US6339736", "US6401027", "US6459961", "US6546330", "US6801837", "US6900739", "US7181343", "US7355524", "US7504986", "US7545286", "US8040253", "US20020198653", "US20030125845", "US20030160685", "US20050043879", "US20050196020", "US20050264402", "US20070179712", "US20070188347", "US20080174453", "US20090243825", "US20130321615", "DE102006016807A1"], "title": "Method for Wireless Communication Between Vehicles", "summary": "The invention relates to a method for wireless communication between vehicles (2, 3), according to which a second vehicle (3) located in relation to a first vehicle (2) is identified by the first vehicle; the second vehicle (3) emits wireless driving information which is received by the first vehicle, the driving information comprising information on the traffic situation in the surroundings of the second vehicle (3) and/or on the state variables of the second vehicle (3); the driving information received in the first vehicle (2) is processed in the first vehicle (2); and the processed driving information is outputted in the first vehicle (2) at least partially by means of an output means.", "assignee": ["Continental Automotive Gmbh"], "publication_date": "19 avr. 2012", "id": "US20120095641", "referenced_by": ["US8655575", "US20120253646", "US20120290198", "WO2013187835A1"], "inventors": ["Stephan Merk"]},
{"international_classification": ["G08G1/137"], "us_classification": "", "reference": ["US5289185", "US6674484", "US7996151", "US20020133291", "US20040098191", "US20040204832", "US20060195257", "US20070050129", "US20070124157", "US20070159922", "US20070176794", "US20080167811", "US20080195315", "US20090005961", "US20090177383", "US20100131186", "US20110179363"], "title": "Method and Device for Displaying Information in a Vehicle", "summary": "In a method for displaying information in a vehicle, a geographic map is displayed on a display surface, a symbol for the vehicle is displayed within the geographic map, the position of the symbol relative to the geographic map changing as a function of the geographic position of the vehicle, and a graphic object including supplementary information being displayed within the geographic map as a function of the geographic position of the vehicle. An image sequence including multiple images for the graphic object is produced and displayed as a function of the geographic position of the vehicle such that at the end of the image sequence the graphic object has disappeared or can no longer be assigned to the supplementary information. A device is adapted to implement the method described above.", "assignee": ["Volkmar Wagner, ", "Indra-Lena Koegler, ", "Daniel Canis"], "publication_date": "8 sept. 2011", "id": "US20110215950", "referenced_by": [], "inventors": ["Volkmar Wagner, ", "Indra-Lena Koegler, ", "Daniel Canis"]},
{"international_classification": ["G01C21/26"], "us_classification": "", "reference": ["US6411867", "US20120249794"], "title": "Method for displaying images on a display device and driver assistance system", "summary": "A method for displaying images (15, 18, 21) on a display device (3) of a driver assistance system (2) in a motor vehicle (1) is made available. Navigation data is received by the driver assistance system (2), and sensor data relating to the surroundings (10 to 13) of the motor vehicle (1) is acquired by at least one sensor (5 a to 5 d) of the driver assistance system (2). A control device (4) processes the sensor data to form a surroundings image (15, 18) which shows at least a surrounding area (16, 19) next to the motor vehicle (1). A map image (21) which is generated while taking into account the navigation data on stored map data is displayed on the display device (3). Enlargement and/or zooming in of the map image (21) take/takes place on the display device (3). After a predetermined mapping scale (zoom factor) of the map image (21) has been reached, there is a change from the map image (21) to the surroundings image (15, 18). A driver assistance system (2) which serves to carry out the method is also made available.", "assignee": ["Valeo Schalter Und Sensoren Gmbh"], "publication_date": "25 juil. 2013", "id": "US20130191022", "referenced_by": ["US20120158237"], "inventors": ["Joachim Mathes, ", "Patrice REILHAC"]},
{"international_classification": ["B62D5/04"], "us_classification": "", "reference": [], "title": "Steering-wheel-hold detection for lane keeping assist feature", "summary": "A system and method for determining whether a vehicle driver is holding a steering wheel of the vehicle. The vehicle will include an electric power steering (EPS) system and may include an active front steering (AFS) system. The vehicle may further include autonomous or semi-autonomous driving features or safety features, such as Lane Centering Control (LCC) or Lane Keeping Assist (LKA). The system monitors steering torque and steering angle signals, determines a resonant frequency of oscillation of the steering system from the measured data, and compares the resonant frequency to a known natural frequency of the steering system. If the resonant frequency is lower than the known natural frequency, then the system knows that the vehicle driver is holding the steering wheel. A measured steering torque greater than a threshold value is also taken as an immediate indication of the driver holding the steering wheel.", "assignee": ["GM Global Technology Operations LLC"], "publication_date": "11 sept. 2014", "id": "US20140257628", "referenced_by": [], "inventors": ["Jin-woo Lee, ", "Bakhtiar Brian Litkouhi, ", "Hsun-Hsuan Huang"]},
{"international_classification": ["G06F19/00"], "us_classification": "", "reference": [], "title": "Intelligent road signs", "summary": "An approach is provided for providing customized information to a driver of a vehicle. The approach is implemented in a computer infrastructure having computer executable code on a computer readable storage medium having programming instructions operable to: obtain one or more parameters of a vehicle; obtain environmental conditions outside of the vehicle; and calculate a speed at which the vehicle should traverse a portion of a road. The calculating is based on the one or more parameters of the vehicle and the environmental conditions outside of the vehicle. The approach is further operable to provide the calculated speed to the vehicle.", "assignee": ["International Business Machines Corporation"], "publication_date": "10 juil. 2014", "id": "US20140195068", "referenced_by": [], "inventors": ["Gregory J. Boss, ", "Andrew R. Jones, ", "Kevin C. McConnell, ", "John E. Moore, JR."]},
{"international_classification": ["G06K9/00", "G05D1/02", "G08G1/16", "G06T7/20", "B60R21/01"], "us_classification": "", "reference": [], "title": "Collision Warning System", "summary": "A method of estimating a time to collision (TTC) of a vehicle with an object comprising: acquiring a plurality of images of the object; and determining a TTC from the images that is responsive to a relative velocity and relative acceleration between the vehicle and the object.", "assignee": ["Mobileye Technologies Ltd."], "publication_date": "5 juin 2014", "id": "US20140156140", "referenced_by": [], "inventors": ["Gideon Stein, ", "Erez Dagan, ", "Ofer Mano, ", "Amnon Shashua"]},
{"international_classification": ["G08G1/09", "B60W40/02", "B60W30/00", "G01C21/26", "B60W30/18"], "us_classification": "", "reference": ["US6989766", "US7605694", "US20080103655", "US20090224942", "US20100020170", "US20100145600", "US20100222965", "US20110254701"], "title": "Driver assistance device and method of controlling the same", "summary": "A driver assistance device to be disposed in a vehicle includes a traffic signal information acquiring section, an intersection distance acquiring section, a target speed calculating section, and an outputting section. The traffic signal information acquiring section acquires traffic signal information that includes current and future lighting colors and lighting times of respective lighting colors of a traffic signal located in a traveling direction of the vehicle. The intersection distance acquiring section acquires an intersection distance between the vehicle and an intersection at which the traffic signal is located. The target speed calculating section calculates a target speed range to enable the vehicle to enter the intersection in a state where the lighting color of the traffic signal is green. The outputting section outputs the target speed range.", "assignee": ["Denso Corporation"], "publication_date": "27 oct. 2011", "id": "US20110260886", "referenced_by": ["US8618953", "US20130110316", "US20130135117", "US20130194110"], "inventors": ["Michinaga Nagura, ", "Seigou Kumabe"]},
{"international_classification": ["H04N5/235"], "us_classification": "", "reference": ["US20040227814", "US20060125919", "US20060203092", "US20080042812", "US20080137908"], "title": "Method for exposure control for a camera in a motor vehicle", "summary": "A method for exposure control for a camera system in a motor vehicle is provided. The camera system records a sequence of images of the surroundings of the vehicle using an optimal exposure time. The optimal exposure time is predetermined depending on the brightness of the surroundings or on the brightness of individual objects in the image. If the optimal exposure time is longer than a predetermined threshold value, at least one intermediate image is recorded using a short predetermined exposure time, i.e. an exposure time shorter than the optimal exposure time. At least two driver assistance functions are executed on the basis of the image data of the camera system. The image data recorded using the optimal exposure time is used for a first driver assistance system and the image data recorded using the short exposure time is used for a second driver assistance system.", "assignee": ["Adc Automotive Distance Control Systems Gmbh"], "publication_date": "30 juin 2011", "id": "US20110157362", "referenced_by": [], "inventors": ["Dieter Krokel"]},
{"international_classification": ["G01C21/26", "G06F17/30"], "us_classification": "", "reference": ["US6047234", "US6366851", "US6381533", "US6385539", "US6560531", "US6674434", "US6850841", "US6856897", "US7035733", "US8073617", "US8170786", "US8195393", "US8314718", "US8359156", "US8725404", "US20100191461", "US20100305850", "US20120004845", "JP2002318533A", "JP2003345237A", "JP2005062854A", "JP2008164373A"], "title": "Method of creating map data", "summary": "A computerised method of creating map data from a plurality of trips where each trip comprises position data derived from the positions of at least one navigation device 200 over a period of time, the method comprising using a processing circuitry to perform the following steps: i. processing the position data; ii. determining from the processing the believed accuracy of the position data constituting a trip; iii. reducing the weight applied to and/or removing position data in which the belief is below a predetermined threshold to generate filtered position data; iv. deriving information about the road 700 based upon the filtered position data; and v. generating further map data.", "assignee": ["Hubert Nowak, ", "Rafal Jan Gliszczynski"], "publication_date": "16 aot 2012", "id": "US20120209518", "referenced_by": ["US8718927", "US20130030690", "US20130238235"], "inventors": ["Hubert Nowak, ", "Rafal Jan Gliszczynski"]},
{"international_classification": ["G01C21/26"], "us_classification": "", "reference": ["US5026153", "US6023653", "US6289278", "US6498620", "US7233864", "US7561955", "US7612797", "US7840026", "US8447519", "US8612150", "US20020087269", "US20020183906", "US20110087433", "US20110109745"], "title": "Technique for calculating a location of a vehicle", "summary": "A technique for calculating a location of a first vehicle is described. A method implementation of this technique comprises the steps of detecting, from the perspective of the first vehicle, a movement of a second vehicle relative to the first vehicle, determining, for the time of the relative movement, a location of the second vehicle based on the detected relative movement by matching the detected movement of the second vehicle against map data, measuring, for the time of the relative movement, a distance between the first and second vehicles, and calculating the location of the first vehicle based on the measured distance and the determined location of the second vehicle. The technique also comprises an apparatus, a computer program product, and a vehicle navigation system.", "assignee": ["Elektrobit Automotive Gmbh"], "publication_date": "31 janv. 2013", "id": "US20130030697", "referenced_by": [], "inventors": ["Florian Bartels"]},
{"international_classification": ["H03M1/12"], "us_classification": "", "reference": [], "title": "Apparatus and method for reducing sampling circuit timing mismatch", "summary": "An example apparatus, system, and method for sampling in an interleaved sampling circuit having multiple channels. In an embodiment, an input clock is used to synchronize the transitions of sampling clocks from a first to second voltage level, relative to one another. The sampling clocks are input to a sampling circuit. The input clock switches a common switch that pulls each sampling clock to the second voltage level through a common path on input clock transitions from a first to a second clock state. The transition from the first to a second voltage level of each sampling clock triggers a sample taken on one of the channels. The first voltage level may be boosted to drive switches on in the sampling circuit. Synchronizing transitions of the outputs through the common switch and common path reduces timing mismatch between the sampling clocks controlling the channels.", "assignee": ["Analog Devices, Inc."], "publication_date": "11 sept. 2014", "id": "US20140253353", "referenced_by": [], "inventors": ["Lawrence A. Singer, ", "Siddharth Devarajan"]},
{"international_classification": ["B60Q1/00", "G06F7/00"], "us_classification": "", "reference": ["US5815072", "US7634341", "US20060028330", "US20070001830", "US20070150157", "EP0790592A1"], "title": "Method for communicating a deviation of a vehicle parameter", "summary": "A method, a device and a system for communicating in a vehicle at least one deviation of a measured actual vehicle parameter value from its predetermined value to a driver involve determining an amount of the deviation, color-coding the amount of deviation, and communicating the amount of deviation to the driver by using the color-code. Determining the amount of deviation includes weighting a calculated difference between the measured actual vehicle parameter value and the predetermined vehicle parameter value with a weighting factor. A vehicle or more particularly a truck may include such a device and such a system and a computer programmed for performing such a method and computer readable medium comprising a program for performing such a method can be provided.", "assignee": ["Volvo Technology Corporation"], "publication_date": "16 sept. 2010", "id": "US20100231372", "referenced_by": [], "inventors": ["Joel Sandstrm, ", "Emma Rozadas"]},
{"international_classification": ["G06F3/00"], "us_classification": "", "reference": ["US20060146814", "US20060149860"], "title": "System and method for redirecting input/output (I/O) sequences", "summary": "A method for redirecting I/O (Input/Output) sequences. A computer platform is initialized. If the computer platform is enabled for command packet rerouting, the platform firmware may be used to install a runtime enable block I/O interface and a standard UNDI (Universal Network Device Interface) interface for routing I/O requests to a network controller or an out-of-band processor may be used to route I/O requests to a network interface controller. The routing of the I/O requests to the network controller or network interface controller enables the computer platform to boot from a remote block I/O storage device.", "assignee": ["Rothman Michael A, ", "Zimmer Vincent J"], "publication_date": "5 juin 2008", "id": "US20080133794", "referenced_by": [], "inventors": ["Michael A. Rothman, ", "Vincent J. Zimmer"]},
{"international_classification": ["G06F12/00"], "us_classification": "", "reference": ["US5633946", "US6516267", "US7518533"], "title": "Self-learning map on basis on environment sensors", "summary": "A self-learning map or a device for creating and storing a digital map for a transport unit on the basis of environmental sensors, vehicle-to-X communication and satellite navigation systems. The self-learning map and device create and store the digital map without the use of data from navigation maps. The obtained digital map is iteratively improved and can be used for the validity check of an existing digital map for a driver assistance system.", "assignee": ["Continental Teves Ag & Co. Ohg"], "publication_date": "24 fvr. 2011", "id": "US20110047338", "referenced_by": ["US20120290198", "WO2014044784A1"], "inventors": ["Ulrich Stahlin, ", "Thomas Grotendorst"]},
{"international_classification": ["G06F7/00", "G06G7/70"], "us_classification": "", "reference": [], "title": "System and method for simulating the performance of a virtual vehicle", "summary": "A mobile computing apparatus simulates the performance of a virtual vehicle using the route, driving behavior and loading experience of a baseline vehicle. The baseline vehicle is instrumented and operational data is collected, forming a data set. The apparatus includes simulator logic configured to construct a duty cycle from the data set representative of the operation of the baseline vehicle during travel along the route (e.g., a loading duty cycle). The data set includes route data with distance and vehicle speed information, engine data associated with the engine, and operational element data. The logic defines a virtual vehicle that is the same as the baseline vehicle but that includes a virtual operational element, such as a transmission, that is different than that in the baseline vehicle. The logic determines a performance characteristic, such as fuel economy, of the virtual vehicle using the constructed duty cycle.", "assignee": ["Eaton Corporation"], "publication_date": "26 sept. 2013", "id": "US20130253782", "referenced_by": [], "inventors": ["Benjamin J. Saltsman, ", "Xubin Song, ", "Benjamin J. Morris, ", "Chia-Hsiang Liu, ", "Zhijun Tang"]},
{"international_classification": ["B60Q1/14"], "us_classification": "", "reference": ["US6443603", "US6960005", "US7237928", "US7415338", "US8408763"], "title": "Method for Controlling a Headlamp System for a Vehicle, and Headlamp System", "summary": "In a method for controlling a headlamp system of a vehicle, road users are detected in front of the vehicle in the driving direction, and a total light pattern produced by the headlamp system is controlled such that it provides an illumination range in the direction of at least one detected road user that is less than the distance to the detected road user, and which provides an illumination range in another direction that is greater than the distance to the detected road user. The illumination range in the other direction is controlled as a function of the horizontal angle between the driving direction of the vehicle and the connecting line from the vehicle to the detected road user or to another detected road user.", "assignee": ["Volkswagen Ag"], "publication_date": "25 oct. 2012", "id": "US20120271511", "referenced_by": ["WO2014089042A1"], "inventors": ["Karsten Dierks, ", "Martin Freese, ", "Bernd Jahrsau"]},
{"international_classification": ["G01C21/34", "G06F17/00"], "us_classification": "", "reference": ["US5900803", "US6501376", "US20080113522", "US20090146846", "US20090219148", "US20090271078", "US20100026084", "US20110015809", "US20110160956", "DE10033345A1", "DE202009010272U1"], "title": "Motor vehicle combination and method for operating", "summary": "A motor vehicle combination is provided. The motor vehicle combination includes a towing vehicle. The towing vehicle is embodied as passenger car. In addition, the motor vehicle combination includes at least one trailer. The at least one trailer can be mechanically connected to the towing vehicle. In addition, the motor vehicle combination comprises a bidirectional communication unit, which is designed for exchanging data between the towing vehicle and the at least one trailer.", "assignee": ["GM Global Technology Operations LLC"], "publication_date": "20 juin 2013", "id": "US20130158740", "referenced_by": [], "inventors": ["Peter Kahler, ", "Marten Wittorf"]},
{"international_classification": ["G06K9/00"], "us_classification": "", "reference": ["US6956469", "US8229164", "US8385599"], "title": "Method and apparatus for real-time pedestrian detection for urban driving", "summary": "A computer implemented method for detecting the presence of one or more pedestrians in the vicinity of the vehicle is disclosed. Imagery of a scene is received from at least one image capturing device. A depth map is derived from the imagery. A plurality of pedestrian candidate regions of interest (ROIs) is detected from the depth map by matching each of the plurality of ROIs with a 3D human shape model. At least a portion of the candidate ROIs is classified by employing a cascade of classifiers tuned for a plurality of depth bands and trained on a filtered representation of data within the portion of candidate ROIs to determine whether at least one pedestrian is proximal to the vehicle.", "assignee": ["Sang-Hack Jung, ", "Mayank Bansal, ", "Bogdan Calin Mihai Matei, ", "Jayan Eledath, ", "Harpreet Singh Sawhney, ", "Rakesh Kumar, ", "Raia Hadsell"], "publication_date": "20 oct. 2011", "id": "US20110255741", "referenced_by": ["US8744752", "US8843424", "US20110279652", "US20120027268", "US20120089545", "US20120101719", "US20120201470"], "inventors": ["Sang-Hack Jung, ", "Mayank Bansal, ", "Bogdan Calin Mihai Matei, ", "Jayan Eledath, ", "Harpreet Singh Sawhney, ", "Rakesh Kumar, ", "Raia Hadsell"]},
{"international_classification": ["G05D1/02", "B60R21/01", "B60Q9/00", "G08G1/16", "G06K9/00", "G06T7/20"], "us_classification": "", "reference": [], "title": "Collison Warning System", "summary": "A method of estimating a time to collision (TTC) of a vehicle with an object comprising: acquiring a plurality of images of the object; and determining a TTC from the images that is responsive to a relative velocity and relative acceleration between the vehicle and the object.", "assignee": ["Mobileye Technologies Ltd."], "publication_date": "3 avr. 2014", "id": "US20140093132", "referenced_by": ["US20130141251"], "inventors": ["Gideon Stein, ", "Erez Dagan, ", "Ofer Mano, ", "Amnon Shashua"]},
{"international_classification": ["H04L12/26"], "us_classification": "", "reference": ["US8004993", "US20050283681", "US20090086653", "US20090122812", "US20100220744"], "title": "System and method for testing a communications network having a central bus guardian (cbg) to detect a faulty condition associated with the cbg", "summary": "Systems and methods for testing a communications network having a central bus guardian (CBG) to detect a faulty condition associated with the CBG are described. In one embodiment, a method for testing a communications network having a CBG to detect a faulty condition associated with the CBG includes supplying a communications schedule to the CBG, causing test data to be transmitted between different buses that are connected to the CBG according to the communications schedule, and determining the faulty condition associated to with the CBG based on whether or not the test data is received according to the communications schedule. Other embodiments are also described.", "assignee": ["Nxp B.V."], "publication_date": "21 mars 2013", "id": "US20130070613", "referenced_by": [], "inventors": ["Abhijit Kumar Deb, ", "Sujan Pandey, ", "Hubertus Gerardus Hendrikus Vermeulen"]},
{"international_classification": ["G01N21/55", "G08G1/0967"], "us_classification": "", "reference": ["US5051906", "US20130271613"], "title": "System and Assessment of Reflective Objects Along a Roadway", "summary": "A system for the assessment of reflective surfaces disposed along a roadway repeatedly illuminates an area along the roadway that includes at least one reflective surface using a light source. Multiple light intensity values are measured over a field of view which includes at least a portion of the area illuminated by the light source. A computer processing system is used to identifying a portion of the light intensity values associated with a reflective surface and analyze the portion of the light intensity values to determine assessment for that reflective surface. In one embodiment, a virtual nighttime drive through along a roadway is simulated using a plurality of intensity values to simulate reflections from each reflective surface disposed along the roadway during the virtual drive through.", "assignee": ["Facet Technology Corp."], "publication_date": "6 fvr. 2014", "id": "US20140036269", "referenced_by": [], "inventors": ["Jamie E. Retterath, ", "Robert A. Laumeyer"]},
{"international_classification": ["G01S13/00", "H01P11/00"], "us_classification": "", "reference": ["US6501415", "US6809692", "US7733265", "US8022861", "US8256685", "US20070216587", "US20100277374"], "title": "Gain Enhanced LTCC System-on-Package for UMRR Applications", "summary": "An apparatus, system, and method for Gain Enhanced LTCC System-on-Package radar sensor. The sensor includes a substrate and an integrated circuit coupled to the substrate, where the integrated circuit is configured to transmit and receive radio frequency (RF) signals. An antenna may be coupled to the integrated circuit and a lens may be coupled to the antenna. The lens may be configured to enhance the gain of the sensor.", "assignee": ["King Abdullah University Of Science And Technology"], "publication_date": "9 fvr. 2012", "id": "US20120032836", "referenced_by": [], "inventors": ["Atif SHAMIM, ", "Farhan Abdul Ghaffar, ", "Muhammad Umair Khalid, ", "Khaled Nabil Salama"]},
{"international_classification": ["H01S3/00", "H05B37/02"], "us_classification": "", "reference": ["US6990130", "US20040101007", "US20050259703", "US20060133435"], "title": "Circuit and method for controlling light-emitting components", "summary": "Circuit arrangement or circuit, in particular driver circuit, and a method for controlling at least one light-emitting component, such as an electro-optical transducer, a light-emitting diode (LED), an electroluminescent diode, a laser, or a semiconductor laser, by switching a switching element between a first switching position and a second switching position, and the voltage supply is effected by a supply element, such as a voltage source or a current source supported by a decoupling capacitor on the output side, so that current drain and output resistance are as low as possible, so that the highest possible frequency or switching speed as well as the highest possible output voltage for the light-emitting component can be achieved, the light-emitting component is controlled by varying its operating voltage, in particular by switching between the switching positions, and the first and second switching positions are of low impedance for the operating frequency.", "assignee": ["Martin Groepl, ", "Holger Hoeltke"], "publication_date": "8 juil. 2010", "id": "US20100172385", "referenced_by": ["US8779672", "US8824898"], "inventors": ["Martin Groepl, ", "Holger Hoeltke"]},
{"international_classification": ["G01S15/06"], "us_classification": "", "reference": ["US3454922", "US5260912", "US20050249035", "US20130033964"], "title": "Method and device for actively detecting objects in view of previous detection results", "summary": "A method for detecting an object within a surrounding area of a vehicle, includes: repeatedly transmitting wave pulses into the surrounding area; repeatedly receiving wave pulses, which correspond to the transmitted wave pulses reflected by the objects; detecting the object with the aid of a signal representation of the received wave pulses, and ascertaining at least one signal characteristic of a first received wave pulse. The detecting of the object includes: comparing the curve in the form of the signal characteristic of the first received wave pulse to the curve of a further received wave pulse, which was received after the first received wave pulse, location information of the object being corrected in light of the comparison.", "assignee": ["Matthias Karl"], "publication_date": "7 fvr. 2013", "id": "US20130033964", "referenced_by": ["US20130033964"], "inventors": ["Matthias Karl"]},
{"international_classification": ["H04N5/66"], "us_classification": "", "reference": ["US5530420", "US6947064", "US20050177283", "US20050231340", "US20060085125", "JP2005041433A", "JP2005182753A", "JP2005196666A", "JP2005326963A", "JPS61249849A"], "title": "Method of determining the passage of a vehicle through a gap", "summary": "The invention discloses a method of determining the ability of a vehicle to pass through a restricted gap in the roadway, including the steps of: detecting a restricted gap in the roadway, defining an image of the vehicle, and comparing the vehicle image with the restricted gap.", "assignee": ["Valeo Vision"], "publication_date": "28 fvr. 2008", "id": "US20080049150", "referenced_by": ["US8237792", "US8269616", "US8379926", "US8405722", "US8424621", "US8452599", "US20100280710", "US20100322476", "US20110012718", "EP2703217A1"], "inventors": ["Anne Herbin, ", "Patrice REILHAC"]},
{"international_classification": ["H04N7/18"], "us_classification": "", "reference": ["US6281649", "US6498536", "US20060157639", "US20070041657", "US20080044062", "US20080273753", "US20090180682", "US20100029293", "US20100066867", "US20100195674"], "title": "Method and device for processing recorded image information from a vehicle", "summary": "A method for improving the driver assistance function, in particular of driver assistance systems based on video images recorded from a vehicle, and a corresponding device for that purpose made up of a camera and processing unit. To improve the function during rain, the passing of a windshield wiper through the camera image be used to classify individual images and/or portions of images as being of higher or lower quality, in order to improve the quality of the images from the camera. The images from camera are intended to be used for automatic driver assistance systems.", "assignee": ["Karsten Haug"], "publication_date": "24 fvr. 2011", "id": "US20110043624", "referenced_by": ["US8121348", "US8744642", "US8797417", "US20100226532", "US20110273582", "US20120127336", "US20130073114"], "inventors": ["Karsten Haug"]},
{"international_classification": ["B60Q1/00"], "us_classification": "", "reference": ["US4897630", "US5281949", "US6034617", "US6696931", "US7796021", "US8643493", "US20030222758", "US20060103529", "US20070120644", "US20070182528", "US20070279206", "US20100289885"], "title": "Method of monitoring vehicle surroundings, and apparatus for monitoring vehicle surroundings", "summary": "A technology is provided for monitoring the surroundings of a vehicle in which a driver approaching the vehicle is recognized, obstacles present in the surroundings of the vehicle are searched for, obstacle information is generated for searched and found obstacles, and the driver outside of the vehicle is notified of the obstacle information. The driver approaching the vehicle can be recognized via communication with a mobile communication device carried by the driver. Additionally, the technology determines whether or not the searched and found obstacle is present in a blind spot area of the driver, and notifies the driver outside the vehicle of the obstacle information related to the obstacle when the obstacle is present in the blind spot area of the driver.", "assignee": ["Aisin Seiki Kabushiki Kaisha"], "publication_date": "8 mars 2012", "id": "US20120056734", "referenced_by": ["US20100303253", "US20140032031"], "inventors": ["Keigo IKEDA, ", "Noboru NAGAMINE"]},
{"international_classification": ["G06F7/00"], "us_classification": "", "reference": ["US4913258", "US5343971", "US5376868", "US5465806", "US5492192", "US5508924", "US5615933", "US5973463", "US5982063", "US6704622", "US6885931", "US6909959", "US7072751", "US7440834", "US7441845", "US7455142", "US7530416", "US8321088", "US8521349", "US8556012", "US20040176899", "US20060076828", "US20070257570", "US20080029328", "US20080082246", "US20110238251", "US20130030601"], "title": "Control system and method of vehicle using in-wheel motor", "summary": "Disclosed is a technique for controlling the stability of a vehicle via in-wheel motors. More specifically, a steering angle, a wheel speed, a lateral G-Force, and a yaw rate calculated, and the lateral G-Force is compared with a predetermined lateral G-Force threshold. Next, a predetermined yaw rate control threshold is compared with a difference between an actual yaw rate and a demand yaw rate based on the calculated steering angle and wheel speed. The demand yaw rate and the actual yaw rate are then compared when the difference between the demand yaw rate and the actual yaw rate is greater than the yaw rate control threshold, and a final torque value is generated according to the difference between the demand yaw rate and the actual yaw rate.", "assignee": ["Hyundai Motor Company"], "publication_date": "31 janv. 2013", "id": "US20130030601", "referenced_by": ["US20130030601", "US20130073162"], "inventors": ["Sangyon Yoon"]},
{"international_classification": ["B60T13/66"], "us_classification": "", "reference": ["US5887954", "US7188913", "US20030038541", "US20050082999", "US20100026083"], "title": "Method and Device for Controlling an Electrohydraulic Brake System", "summary": "A system and device and a method for controlling an electrohydraulic brake system of a motor vehicle especially adapted for brake by wire applications. The embodiments carryout position control of an actuator of an electronically activatable pressure supply unit based on the actuator position actual value and on and actuator position reference value which is determined on the basis of a pressure reference value.", "assignee": ["Continental Teves Ag & Co. Ohg"], "publication_date": "14 nov. 2013", "id": "US20130304345", "referenced_by": [], "inventors": ["Jrgen Bhm, ", "Tom Kaufmann"]},
{"international_classification": ["G06F7/00"], "us_classification": "", "reference": ["US7568551", "US8406956", "US20070233344", "US20080255727", "US20080306655", "US20100152952", "US20100235051", "US20110032119"], "title": "Detecting a hands free driving situation of a motor vehicle", "summary": "Embodiments of the inventive subject matter ensure that a hands-free driving situation of a motor vehicle can be detected. In the case of such detection of a hands-free driving situation, requirements of a driving assistance system are preferably reset with respect to steering corrections made by the driving assistance systems. In this manner, virtually independent steering of the vehicle such as, for example, and autopilot type of driving assistance functionality is therefore advantageously avoided.", "assignee": ["Torsten Kluge"], "publication_date": "26 juil. 2012", "id": "US20120191266", "referenced_by": [], "inventors": ["Torsten Kluge"]},
{"international_classification": ["G06F7/00", "H04N7/18", "G08G1/16", "H04N13/02"], "us_classification": "", "reference": ["US6819779", "US20050200467"], "title": "Driver assistance system and method", "summary": "A driver assistance system includes a stereo vision system that includes at least one camera and at least one sensor disposed on or in a vehicle; a roadside marker detection unit configured to receive stereo image data from the stereo vision system, and to detect roadside markers from the stereo image data; and a road path estimation unit configured to estimate a road path in a direction of travel of the vehicle, based on the roadside markers detected by the roadside marker detection unit.", "assignee": ["Tk Holdings Inc."], "publication_date": "4 oct. 2012", "id": "US20120253596", "referenced_by": [], "inventors": ["Faroog Ibrahim, ", "Michael J. Higgins-Luthman"]},
{"international_classification": ["G06F7/00"], "us_classification": "", "reference": ["US8058982", "US20100052888", "US20100057280", "US20100057281", "US20110205044", "US20120078467", "US20120078468", "US20120078496", "DE102010041537A1", "DE102010041539A1", "DE102010041544A1", "JP2008253181A"], "title": "Driver Assistance System for Driver Assistance for Consumption Controlled Driving", "summary": "A driver assistance system for driver assistance for consumption controlled driving combines tactile and visual feedback functions, especially in the form of a drive configuration, a display concept and/or a deceleration assistant, wherein the emphasis is, on the one hand, on a modified accelerator pedal characteristic and, on the other hand, on providing ECO tips for an interactive output of efficient driving instructions.", "assignee": ["Bayerische Motoren Werke Aktiengesellschaft"], "publication_date": "29 mars 2012", "id": "US20120078468", "referenced_by": ["US20120078468", "US20120179347", "US20130173113", "US20130268152"], "inventors": ["Christian Popp, ", "Norman Wiebking, ", "Henrik Wigermo, ", "Andreas Pfeiffer"]},
{"international_classification": ["B60W50/00"], "us_classification": "", "reference": ["US8340866", "US20060290479", "US20090177347", "US20100228437", "US20120245817", "US20120303222", "US20130124052", "US20130131918"], "title": "Vehicle vision system with yaw rate determination", "summary": "A vision system for a vehicle includes a camera disposed at or proximate to an in-cabin portion of a windshield of the vehicle. The camera has a forward field of view to the exterior of the vehicle through the windshield of the vehicle. The camera is operable to capture image data. A control includes an image processor that is operable to process captured image data to determine lane delimiters present in the field of view of the camera. The control connects to a vehicle communication bus of the vehicle and receives vehicle data via the vehicle communication bus. Responsive at least in part to processing of captured image data by the image processor and to vehicle data received via the vehicle communication bus, the control determines a yaw rate. The control provides the determined yaw rate to a driver assistance system of the vehicle.", "assignee": ["Magna Electronics Inc."], "publication_date": "7 aot 2014", "id": "US20140222286", "referenced_by": [], "inventors": ["William J. Chundrlik, Jr., ", "Nathaniel Johnson, ", "Marc Wimmershoff"]},
{"international_classification": ["G01S7/03"], "us_classification": "", "reference": ["US5481268", "US5724042", "US6130640", "US6400308", "US6583753", "US6972709", "US7496158", "US7567206", "US20030156060", "US20050088336", "US20050225481"], "title": "Fmcw radar sensor for motor vehicles", "summary": "An FMCW radar sensor for motor vehicles, having a high frequency part for generating, transmitting and receiving radar signals, a modulation device for controlling the frequency modulation of the transmitted radar signal, at least one analog preprocessing stage for an intermediate frequency signal formed from the received radar signal, at least one analog/digital transducer stage, and a processor for controlling the modulation device and for further processing the digital signals of the analog/digital transducer stage, wherein the modulation device, the preprocessing stage and the analog/digital transducer stage are integrated into a single semiconductor component, which also has a monitoring device and registers for the configuration and monitoring of the components of the semiconductor component as well as an interface to the processor.", "assignee": ["Armin Himmelstoss, ", "Joachim Hauk, ", "Elisabeth Hauk, ", "Rahel Hauk, ", "Manuel Hauk, ", "Thomas Walter, ", "Thomas Schneider"], "publication_date": "15 dc. 2011", "id": "US20110304500", "referenced_by": ["EP2667220A1"], "inventors": ["Armin Himmelstoss, ", "Joachim Hauk, ", "Elisabeth Hauk, ", "Rahel Hauk, ", "Manuel Hauk, ", "Thomas Walter, ", "Thomas Schneider"]},
{"international_classification": ["G08G1/0967"], "us_classification": "", "reference": [], "title": "Vehicle intersection warning system and method", "summary": "A vehicle intersection warning method is provided. The method comprises exchanging host vehicle information and remote vehicle information between a host vehicle and a remote vehicle, determining a presence of a road intersection based on at least one of the host vehicle information and the remote vehicle information. determining, by operation of a processor, whether a possibility of contact between the host vehicle and the remote vehicle exists proximate the intersection based on the exchanged host vehicle information and remote vehicle information, and evaluating an operating condition of a brake of the host vehicle while the possibility of contact exists to determine a type of warning to provide to the host vehicle.", "assignee": ["Nissan North America, Inc."], "publication_date": "29 mai 2014", "id": "US20140145861", "referenced_by": [], "inventors": ["Roy W. Goudy, ", "Neal Probert, ", "Andrew Christensen, ", "Jeremy Chambers"]},
{"international_classification": ["A61B5/04"], "us_classification": "", "reference": ["US3971366", "US5184620", "US5503158", "US5715821", "US7187292", "US20050239075", "US20090259137", "US20100041975"], "title": "Signal detecting device for detecting a difference signal for an electrical measurement of a vital parameter of a living being, electrode arrangement and method", "summary": "What is described are a signal detecting device for detecting a vital parameter of a living being, having a plurality of electrodes and an electrode selecting device for selecting a pair of electrodes from the plurality of electrodes such that a difference signal suitable for measuring the vital parameter is derivable, an electrode arrangement and a method.", "assignee": ["Ershov Sergey, ", "Hans-Joachim Moersdorf, ", "Ruslan Rybalko, ", "Robert Couronne"], "publication_date": "26 mai 2011", "id": "US20110125002", "referenced_by": ["US8755878", "US8774896", "US20110184618", "US20130060120", "EP2604465A1"], "inventors": ["Sergey ERSHOV, ", "Hans-Joachim Moersdorf, ", "Ruslan Rybalko, ", "Robert Couronne"]},
{"international_classification": ["G06F7/00"], "us_classification": "", "reference": ["US6374173", "US6728605", "US7183942", "US7400963", "US7711468", "US7983836", "US8175802", "US8509971", "US20020173881", "US20040015275", "US20070168125", "US20100198450", "US20100211247"], "title": "Adaptive speed control device", "summary": "An adaptive speed control device includes a posted speed change detecting section, a notification section, a set speed signal receiving section, and an adaptive speed control section. The posted speed change detecting section is configured to detect an upcoming change to a posted speed limit at. The notification section is configured to control a user interface device to notify a new posted speed limit at a prescribed notification timing before the vehicle reaches a transition point. The set speed signal receiving section is configured to accept a set speed signal from a user input device. The adaptive speed control section is configured to change a set speed of the vehicle according to the new posted speed limit and to automatically change a speed to the set speed upon receiving the set speed signal at or after a prescribed activation timing that occurs simultaneously with or after the prescribed notification timing.", "assignee": ["Nissan Technical Center North America, Inc."], "publication_date": "26 aot 2010", "id": "US20100217494", "referenced_by": ["US8751133", "US20120215416", "US20130158847", "US20140074370"], "inventors": ["Ron Heft, ", "Hiroshi Tsuda, ", "Hiroshi Kawazoe, ", "Masahide Nakamura"]},
{"international_classification": ["G06K9/46"], "us_classification": "", "reference": ["US5555312", "US7583816", "US8204277", "US8289142", "US8456327", "US20020061123", "US20030103650", "US20030235327", "US20050209748", "US20060239509", "US20080007619", "US20090028388", "US20100054538", "US20100086211"], "title": "Method and device for lane detection", "summary": "A lane detection method wherein a digitized image of a lane is evaluated, including the following steps: detecting edges in the image, determining the angles of the detected edges with respect to a reference edge, removing the edges from the plurality of detected edges, the angle of which lies within a predetermined angle sector, and detecting the lane based on the remaining edges of the plurality of detected edges.", "assignee": ["Conti Temic Microelectronic Gmbh"], "publication_date": "26 avr. 2012", "id": "US20120099766", "referenced_by": ["US8682033", "US20120177250"], "inventors": ["Wladimir klein, ", "Michael Walter"]},
{"international_classification": ["H04B7/04"], "us_classification": "", "reference": ["US20110090985", "US20120213169"], "title": "Enhanced Multi User MIMO Scheduling", "summary": "A spatial multiplexing scheduler in, for example, an eNB or other base station, determines rank n precoders for UEs. Each UE reports the preferred precoder from this set of rank n precoders. The preferred precoder results in imbalance in performance over m layers compared to the rest of (nm) layers. The UEs also report channel quality to the eNB, from which the eNB determines which layer(s) is better for the UE. For example, when n=2 and m=1, the eNB may then select two UEs such that, for the same precoder used by the UEs, the first UE has much higher layer 1 performance than layer 2, and the second UE has much higher layer 2 performance than layer 1. These two UEs may then share the same frequency-time domain resources, with the first UE information sent/received on layer 1, while the second UE information is sent/received on layer 2.  ", "assignee": ["Broadcom Corporation"], "publication_date": "23 janv. 2014", "id": "US20140023154", "referenced_by": [], "inventors": ["Sriram Rajagopal, ", "Gowrisankar SOMICHETTY"]},
{"international_classification": ["B60L1/02", "H05B1/00", "B23P21/00"], "us_classification": "", "reference": ["GB2381179A", "WO2003024155A2"], "title": "Transparent article which can be electrically extensively heated, method for the production thereof and the use thereof", "summary": "An electrically heatable, transparent article and a method for fabricating such article are described. The article comprises an electrically conductive transparent coating and a transparent substrate. The coating is in contact with electrical bus bars and delimits a localized region, which contains a coating-free transparent region.", "assignee": ["Volkmar Offermann, ", "Alwin Timmermann"], "publication_date": "3 mai 2012", "id": "US20120103961", "referenced_by": [], "inventors": ["Volkmar Offermann, ", "Alwin Timmermann"]},
{"international_classification": ["G01C21/34"], "us_classification": "", "reference": ["US20110307166", "US20120053772"], "title": "Route planning device", "summary": "A route planning device plans plural routes from a current location to a destination, calculates an amount of electricity consumed by a motor during driving to the destination along each planned route in each of plural drive modes, calculates an amount of electricity consumed by electric equipment during driving to the destination along each planned route for each of plural operational settings of the electric equipment, calculates an estimated amount of charge remaining in a battery on arrival at the destination, calculates, for each of the planned routes, a total comfort level score for each of the drive modes and/or each of the operational settings of the electrical equipment, selects plural operation plans each formed from a combination of the route, drive mode, and operational setting on the basis of the calculated total comfort level score, and displays the selected operation plans on a display.", "assignee": ["Honda Motor Co., Ltd."], "publication_date": "13 fvr. 2014", "id": "US20140046595", "referenced_by": [], "inventors": ["Daisei Segawa, ", "Taisuke TSURUTANI, ", "Masanori Hayashi, ", "Koichiro Takemasa"]},
{"international_classification": ["G06K9/46"], "us_classification": "", "reference": [], "title": "Method and Device for Identifying an Image Acquisition Feature of a Digital Image and Apparatus for Implementing Such a Device", "summary": "The invention particularly relates to a method for identifying an image acquisition feature of a digital image oriented in a coordinate system having a reference axis. According to the invention, this method comprises the steps of: (A) detecting the contours of each distinctive element of the image;-(B) forming a list including each contour constituted by a rectilinear segment; (C) searching, in the list of rectilinear contours, a pair of significant rectilinear segments; (D) in the case where step (C) is successful, checking for a condition of relative symmetry of the significant rectilinear segments with respect to the reference axis; and (E) producing, respectively in the case where step (D) is successful and in the case where one of steps (C) and (D) fails, a data respectively representative of the presence and absence of perspective in the image acquisition, with respect to the reference axis.", "assignee": ["St-Ericsson Sa, ", "St-Ericsson (France) Sas"], "publication_date": "16 mai 2013", "id": "US20130121585", "referenced_by": [], "inventors": ["Antoine Chouly, ", "Sandrine Merigeault Rhein"]},
{"international_classification": ["H04B1/40"], "us_classification": "", "reference": ["US20030119547", "US20060221894", "US20080057886", "US20090034438", "US20090168701", "US20120134279", "US20120243446"], "title": "Simultaneous Multiband Operation of a MIMO Communication Device", "summary": "A system and method is presented to support simultaneous connections to multiple network connections. For example, a wireless radio of a communication device may be used to transmit or receive data from two network channels, each associated with a network connection. The communication device may allocate a first set of resources from the wireless radio to be used to communicate across a first network channel and allocate a second set of communication resources from the wireless radio to be used to simultaneously communicate a cross a second network channel.", "assignee": ["Broadcom Corporation"], "publication_date": "14 nov. 2013", "id": "US20130301631", "referenced_by": [], "inventors": ["Gireesh Hegde"]},
{"international_classification": ["H04N7/18"], "us_classification": "", "reference": ["US3665826", "US5734357", "US20090046149", "US20090128629", "US20090135253"], "title": "Camera for a vehicle", "summary": "A camera for a vehicle is described. The camera has at least one optoelectronic image converter, a camera housing in whose interior the image converter is accommodated, a camera optical element, which is accommodated in an optical mounting reference surface of the camera housing and is provided for imaging a primary detection area on the image converter, and a camera position reference surface for positioning the camera in relation to a vehicle window. At least one receiving surface for at least one light-guiding device e.g., one or a plurality of mirrors, is formed on the camera housing for deflecting light from at least one additional detection area to the camera optical element. The optical mounting reference surface, camera position reference surface, and receiving surface are preferably formed on a single housing component, e.g., an upper shell.", "assignee": ["Ulrich Seger, ", "Nikolai Bauer"], "publication_date": "29 mars 2012", "id": "US20120075471", "referenced_by": ["US20120207461"], "inventors": ["Ulrich Seger, ", "Nikolai Bauer"]},
{"international_classification": ["G01S13/95", "G01S13/93"], "us_classification": "", "reference": ["US4134677", "US4490720", "US4739327", "US6633815", "US7463181", "US8203481", "US8558730", "US8581774", "US20100309041"], "title": "Method for detecting precipitation using a radar sensor system for motor vehicles", "summary": "A method for detecting precipitation using a radar sensor system for motor vehicles designed for locating objects in the surroundings of the vehicle, in which method a locating signal that is a measure of the received power density as a function of the distance is integrated across a specific distance range lying below a limit distance for detecting precipitation. The locating signal is subjected to a filtering procedure before being integrated, the filtering procedure suppressing the peaks caused by located objects so that the filtered signal forms a measure of the noise level as a function of the distance.", "assignee": ["Stefan Heilmann, ", "Goetz Kuehnle, ", "Bechler Dirk"], "publication_date": "9 fvr. 2012", "id": "US20120032840", "referenced_by": ["US8749429", "US20120032838"], "inventors": ["Stefan Heilmann, ", "Goetz Kuehnle, ", "Dirk BECHLER"]},
{"international_classification": ["G08G1/123"], "us_classification": "", "reference": ["US20020082752", "US20020198635", "US20080094313", "US20120158243"], "title": "Motor Vehicle", "summary": "A motor vehicle includes a plurality of electronic detection devices for detecting and making available vehicle-related information items, wherein the vehicle-related information items relate to various areas or components outside or inside the motor vehicle; a display unit for displaying the vehicle-related information items; an operator control device for detecting an operator control action; and a control unit. The control unit is configured and coupled with the detection devices, the display unit and the operator control device such that in a first display operating state, first vehicle-related information items and a first graphics object, which represents the motor vehicle, are displayed. In a second display operating state, second vehicle-related information items and a second graphics object, which represents the motor vehicle, are displayed. The first graphics object, which represents the motor vehicle, is larger than the second. Switching between the first and the second display operating states is brought about by way of an operator control action.", "assignee": ["Bayerische Motoren Werke Aktiengesellschaft"], "publication_date": "6 oct. 2011", "id": "US20110241906", "referenced_by": [], "inventors": ["Lutz Eckstein, ", "Josef Schumann, ", "Martin ZOBL, ", "Christian Knoll"]},
{"international_classification": ["G08G1/00"], "us_classification": "", "reference": ["US20020019697", "US20080002635", "US20080030370", "US20100076670"], "title": "Using v2x-based in-network message generation, aggregation, distribution and processing protocols to enable road hazard condition warning applications", "summary": "A method for providing messages indicating potential hazardous road conditions using a wireless communications network. Vehicles using the network include sensors that are able to detect various potentially hazardous road conditions, such as rain, fog, icy road conditions, traffic congestion, etc. A plurality of vehicles that detect a specific road condition provide a confidence value that the condition exists. The confidence value is then aggregated by the vehicles with the confidence value of the detected condition from the other vehicles to provide an aggregated result that identifies the probability that the detected road condition is occurring. The aggregated result is then transmitted to other vehicles approaching the road condition, possibly in a multi-hop manner. Alternately, the confidence value from all of the vehicles that detect the condition can be transmitted to approaching vehicles who will provide the aggregated result identifying the potential that the condition exists.", "assignee": ["Gm Global Technology Operations, Inc."], "publication_date": "30 sept. 2010", "id": "US20100250106", "referenced_by": ["US8032081", "US20130078945", "US20130099941", "US20140244104"], "inventors": ["Fan Bai, ", "Donald K. Grimm"]},
{"international_classification": ["G06F17/00"], "us_classification": "", "reference": ["US3854119", "US3876940", "US5289181", "US5495243", "US5739767", "US6011492", "US6252520", "US8346437", "US20050015203", "US20050216171", "US20080125972", "US20100030430", "US20100318263"], "title": "Device and method for driver assistance", "summary": "A driver assistance device for a motor vehicle is provided. The driver assistance device includes an environmental sensor configured for monitoring a monitoring space located laterally to the motor vehicle for the presence of an object. An analysis unit is configured to receive a detection signal from the environmental sensor for estimating a possible endangerment of the motor vehicle by the object present in the monitoring space and to deliver a result signal representative of the endangerment. The analysis unit is configured to judge on the basis of the detection signal whether the object present in the monitoring space is approaching a lane adjacent to a lane traveled by the motor vehicle and to signal a result of a judgment in the result signal.", "assignee": ["GM Global Technology Operations LLC"], "publication_date": "25 oct. 2012", "id": "US20120271539", "referenced_by": [], "inventors": ["Heiko Bald, ", "Aiko Boehme"]},
{"international_classification": ["G05D1/02"], "us_classification": "", "reference": ["US6292094", "US20040260439", "US20050074143"], "title": "Trailer backing aid using gps mapping and camera image display", "summary": "A method of controlling a vehicle and trailer assembly comprises initiating an input mode for a trailer backing system. A first set of data points, a second set of data points, and a third set of data points are input into the trailer backing system. The input mode for the trailer backing system is ended. An intended backing path is determined based upon the first, second, and third set of data points.", "assignee": ["Continental Automotive Systems, Inc."], "publication_date": "20 juin 2013", "id": "US20130158803", "referenced_by": [], "inventors": ["Philip M. Headley"]},
{"international_classification": ["G01N21/17"], "us_classification": "", "reference": ["US20050051743", "US20080226147", "US20110018990", "US20120147187", "US20120242835", "US20120268602", "US20130136306", "EP2463806A1", "WO2012002552A1"], "title": "Object identification device", "summary": "An object identification device identifying an image region of an identification target includes an imaging unit receiving two polarization lights and imaging respective polarization images, a brightness calculation unit dividing the two polarization images into processing regions and calculating a brightness sum value between the two polarizations images for each processing region, a differential polarization degree calculation unit calculating a differential polarization degree for each processing region, a selecting condition determination unit determining whether the differential polarization degree satisfies a predetermined selecting condition, and an object identification processing unit specifying the processing region based on the differential polarization degree or the brightness sum value depending on whether the predetermined selecting condition is satisfied and identifying plural processing regions that are specified as the processing regions as the image region of the identification target.", "assignee": ["Xue Li, ", "Hideaki Hirai"], "publication_date": "30 mai 2013", "id": "US20130136306", "referenced_by": ["US8831286", "US20130136306"], "inventors": ["Xue Li, ", "Hideaki Hirai"]},
{"international_classification": ["B60Q9/00"], "us_classification": "", "reference": ["US20110213520", "US20120032637", "US20120035795", "US20120083932", "US20120112696", "US20120136570", "US20120253655"], "title": "System for supporting a user of an electrically driven vehicle", "summary": "A system for supporting a user of an electrically driven vehicle comprises position information obtaining unit for obtaining, during traveling, position information indicating a position of the vehicle, electric power amount estimating unit for estimating, during traveling, a remaining electric power amount of an electric power source of the vehicle, shortage risk estimating unit for estimating, during traveling, an estimated risk of electric power amount shortage on the basis of the estimated remaining electric power amount, and notifying unit for notifying a user in case the estimated risk of electric power amount shortage estimated by the shortage risk estimating unit exceeds a predetermined threshold value.", "assignee": ["Hitachi Automotive Systems, Ltd."], "publication_date": "29 aot 2013", "id": "US20130226441", "referenced_by": ["US8731977", "US8768624", "US20120136574", "US20130063283", "US20140052368"], "inventors": ["Yuki Horita"]},
{"international_classification": ["B62D6/00", "G06F7/00"], "us_classification": "", "reference": ["US8326504", "US20050209763", "US20060076828", "US20060103511", "US20090198425", "US20100063702", "US20110257860", "US20120109471", "US20120185131", "US20120200706"], "title": "Detection of and counter-measures for jackknife enabling conditions during trailer backup assist", "summary": "A vehicle comprises a trailer angle detection apparatus and a trailer backup control system coupled to the trailer angle detection apparatus. The trailer angle detection apparatus is configured for outputting a signal generated as a function of an angle between the vehicle and a trailer towably attached to the vehicle. The trailer backup control system includes a jackknife enabling condition detector and a jackknife counter-measures controller. The jackknife counter-measures controller alters a setting of at least one vehicle operating parameter for alleviating an adverse jackknife condition during backing of the trailer by the vehicle when the jackknife enabling condition detector determines that a jackknife enabling condition has been attained at a particular point in time during backing of the trailer by the vehicle.", "assignee": ["Rupp Matt Y, ", "Taehyun Shim, ", "David Dean Smit, ", "Erick Michael Lavoie, ", "Roger Amold Trombley, ", "Thomas Edward Pilutti"], "publication_date": "25 oct. 2012", "id": "US20120271512", "referenced_by": ["US20120271515"], "inventors": ["Matt Y. Rupp, ", "Taehyun Shim, ", "David Dean Smit, ", "Erick Michael Lavoie, ", "Roger Amold Trombley, ", "Thomas Edward Pilutti"]},
{"international_classification": ["G06F7/00", "G06N5/02", "G06F15/18"], "us_classification": "", "reference": ["US6349246", "US6393348", "US6496724", "US6580973", "US6625485", "US6632174", "US7039551", "US7072753", "US7194347", "US7248997", "US7292152", "US7344251", "US7349782", "US7394393", "US7423540", "US7438418", "US7574254", "US7579942", "US7629899", "US7639148", "US7642922", "US7652583", "US7692548", "US7692549", "US7692550", "US7692551", "US7705738", "US7801332", "US7831314", "US7831350", "US7880621", "US7902693", "US7974748", "US7979172", "US8035496", "US8068968", "US8160560", "US8164463", "US8295542", "US8301108", "US8369608", "US8447072", "US8487775", "US8688180", "US20020120371", "US20020138197", "US20040252027", "US20050030184", "US20050067493", "US20050159853", "US20050192730", "US20060200008", "US20070013868", "US20070032914", "US20070050110", "US20080009965", "US20080077474", "US20080097699", "US20090164132", "US20100010742", "US20100030586", "US20100052945", "US20100073152", "US20100082251", "US20100106387", "US20100156630", "US20100169009", "US20100179719", "US20120078063"], "title": "Mediation of tasks based on assessments of competing cognitive loads and needs", "summary": "Among other things, one or more techniques and/or systems are disclosed for mediating tasks in real-time for safety-related concerns. A nature for a safety-related primary task, such as contextual elements of the task, is determined; and a nature of a secondary task that draws attention away from the primary task is also determined. A risk factor for a potential lack of cognitive resources which may be needed by the primary task is determined by applying the nature of the primary task and the nature of the secondary task to a trained risk factor model. The risk factor is applied to one or more safety-related systems in real-time, for example, to mitigate potential safety concerns.", "assignee": ["Microsoft Corporation"], "publication_date": "5 janv. 2012", "id": "US20120004802", "referenced_by": [], "inventors": ["Eric Horvitz, ", "Shamsi Tamara Iqbal"]},
{"international_classification": ["B62D6/00"], "us_classification": "", "reference": ["US5765116", "US6873911", "US20030046021", "US20090299573"], "title": "Motor vehicle, in particular automobile, and method for controlling a motor vehicle, in particular an automobile", "summary": "A motor vehicle and a method for controlling a motor vehicle in road traffic are provided. A motor vehicle includes a driver assistance system and a navigation means comprising a sensor for detecting compressive forces, or tensile forces, or torsional forces. An evaluation unit is coupled to the navigation means and evaluates the signals of the sensor. The evaluation unit puts the driver assistance system into operation or takes it out of operation when a threshold value of the signals stored in the evaluation unit is exceeded or fallen below. A controller is activated when the threshold value is exceeded or fallen below and transfers at least partial control of the motor vehicle by the driver assistance system to manual operation by a driver or transfers the manual control of the motor vehicle to at least partial control by the driver assistance system.", "assignee": ["GM Global Technology Operations LLC"], "publication_date": "28 mars 2013", "id": "US20130079991", "referenced_by": [], "inventors": ["Christoph Schmidt"]},
{"international_classification": ["B60G17/015"], "us_classification": "", "reference": ["US20070152427"], "title": "Suspension Control System To Facilitate Wheel Motions During Parking", "summary": "A method for controlling a vehicle includes the step of determining if a curb parking operation is feasible for the vehicle. If a curb parking operation is deemed infeasible, an operator of the vehicle is notified that curb parking is infeasible. If a curb parking operation is deemed feasible, actuatable elements of the vehicle are controlled to facilitate the curb parking operation.", "assignee": ["Ford Global Technologies, Llc"], "publication_date": "10 juil. 2014", "id": "US20140195114", "referenced_by": [], "inventors": ["Eric H. Tseng, ", "Davor Hrovat, ", "Jianbo Lu, ", "Mitch McConnell, ", "Matthias Dehmel, ", "Michael Seemann, ", "Fredrick V. Owens"]},
{"international_classification": ["G06F17/00", "G06F3/048"], "us_classification": "", "reference": ["US6971070", "US7519922", "US20070088478"], "title": "Method and device for assisting parking of a motor vehicle", "summary": "A method and device for selecting a parking assistance function from a predefined group of parking assistance functions of a parking steering assistant by an input element of the parking steering assistant of a motor vehicle. The parking assistance functions are arranged in two groups, wherein the first group includes the functions which relate to parking of the vehicle and the second group includes functions which relate to exiting a parking space by the vehicle. A selection is made between the two function groups as a function of the ignition switch state and a distance traveled by the vehicle, as a result of which the method differentiates automatically between parking functions and parking space exiting functions.", "assignee": ["Volkswagen Ag"], "publication_date": "21 mars 2013", "id": "US20130073119", "referenced_by": ["US20110115913"], "inventors": ["Philipp Hger, ", "Frank Schwitters"]},
{"international_classification": ["G06K9/62", "B60W40/10"], "us_classification": "", "reference": ["US6285393", "US6963657", "US7260460", "US8155798"], "title": "Method for Estimating the Roll Angle in a Travelling Vehicle", "summary": "The invention relates to a method for estimating the roll angle in a travelling vehicle (7), comprising the following steps. In step a), a camera (8) is used to record a sequence of images of the vehicle's surroundings, in particular of the road (1) ahead. In step b), at least one signature (S1-S6) on the road surface is extracted from the camera images, i.e. said signature is determined and tracked. The changed position of the at least one signature (S1-S6) in one or more subsequent camera image(s) is used in step c) to determine in which direction the camera (8) is turned with regard to the roll angle.", "assignee": ["Conti Temic Microelectronic Gmbh"], "publication_date": "8 nov. 2012", "id": "US20120281881", "referenced_by": [], "inventors": ["Michael Walter"]},
{"international_classification": ["G06K9/00"], "us_classification": "", "reference": ["US6928180", "US7924462", "US8189871", "US8456327"], "title": "Method and system for evaluating brightness values in sensor images of image-evaluating adaptive cruise control systems, especially with respect to day/night distinction", "summary": "The invention proposes a method and an arrangement for evaluating sensor images of an image-evaluating environment recognition system on a carrier, in which, in order to distinguish the light conditions in the area of the image-evaluating environment recognition system with regard to day or night, at least the gain and/or the exposure time of the at least one image sensor detecting the environment is/are monitored, a profile of the gain and/or the exposure time against time with relatively high gain or relatively long exposure times characterizing night-time light conditions, and a profile of the gain and/or the exposure time with relatively low gain and/or relatively short exposure times characterizing daytime light conditions. The environment recognition system according to the invention can also be used to search the detected environment for bright objects, the headlights of another carrier being used as additional information, for example.", "assignee": ["Bendix Commercial Vehicle Systems Llc"], "publication_date": "26 sept. 2013", "id": "US20130251208", "referenced_by": [], "inventors": ["Andreas Kuehnle, ", "Cathy Boon"]},
{"international_classification": ["G01S13/34"], "us_classification": "", "reference": ["US3896436", "US4136341", "US4384291", "US5325095", "US5568150", "US6028548", "US6646587", "US6917327", "US7205931", "US7460055"], "title": "Radar sensor having two oscillators, two i/q transmit mixers, and two i/q receive mixers", "summary": "A radar sensor for motor vehicles, having a transmitting part, which has two oscillators and a 90 phase shifter for generating a transmission signal, a first comparison signal, and a second comparison signal, which is phase shifted by 90 with respect to the first comparison signal, and a receiving part having an I mixer for mixing a received signal with the first comparison signal and a Q mixer for mixing the received signal with the second comparison signal, in which the transmitting part has a first transmit mixer, whose inputs are directly connected to the two oscillators, and a second transmit mixer, whose one input is directly connected to a first of the two oscillators and whose other input is connected via the phase shifter to the other oscillator.", "assignee": ["Juergen Hasch, ", "Andre Manicke"], "publication_date": "27 sept. 2012", "id": "US20120242538", "referenced_by": [], "inventors": ["Juergen Hasch, ", "Andre Manicke"]},
{"international_classification": ["G01S13/00"], "us_classification": "", "reference": ["US5371505", "US5485159", "US6348889", "US7486222", "US20070085728", "US20120032838", "US20120268317", "DE102009001231A1", "EP2401633B1", "WO2010097138A1"], "title": "FMCW Radar Sensor System Having a Device for Detecting a Radome Coating", "summary": "An FMCW radar sensor system is described having an antenna covered by a radome, a mixer for mixing a frequency-modulated transmission signal with a signal received by the antenna, a device for recording the mixed product of the mixer as a time-dependent signal, a device for calculating the spectrum of the time-dependent signal, and a device for detecting a reflecting coating on the radome, characterized in that the device for detecting the reflecting coating is configured for analyzing the time-dependent signal and for determining the extent of reflection on the radome based on the amplitude of this signal.", "assignee": ["Armin Himmelstoss, ", "Stefan Heilmann, ", "Joachim Hauk, ", "Elisabeth Hauk, ", "Rahel Hauk, ", "Manuel Huak, ", "Goetz Kuehnle, ", "Bechler Dirk"], "publication_date": "25 oct. 2012", "id": "US20120268317", "referenced_by": ["US8823582", "US20120146838", "US20120268317"], "inventors": ["Armin Himmelstoss, ", "Stefan Heilmann, ", "Joachim Hauk, ", "Elisabeth Hauk, ", "Rahel Hauk, ", "Manuel Huak, ", "Goetz Kuehnle, ", "Dirk BECHLER"]},
{"international_classification": ["G01S13/58"], "us_classification": "", "reference": ["US4146890", "US6924762", "US8436764", "US20040252047", "US20090121915", "US20090219190", "US20090224960", "US20090315761", "US20110181456", "US20110309968", "US20120146835"], "title": "Fmcw radar sensor and method for frequency matching", "summary": "In a method for frequency matching in an FMCW radar sensor, a plurality of frequencies, which are derived on various modulation ramps, and which respectively are shown by the radar sensor in a d-v space as geometrical locations, represent possible combinations of a distance d and a speed v of the respective object. In order to identify the objects located on the various modulation ramps, coincidences between the geometrical locations which belong to frequencies derived on various modulation ramps are searched for. The search for coincidences is initially restricted in a first step to a subspace of the d-v space, and in a subsequent step, the search is extended to other regions of the d-v space, while suppressing the frequencies that are associated with the objects found in the first step.", "assignee": ["Volker Gross, ", "Wolf Steffens, ", "Stephan Leinbaum, ", "Goetz Kuehnle, ", "Andre Treptow"], "publication_date": "14 juin 2012", "id": "US20120146835", "referenced_by": ["US8760341", "US8823580", "US20120092209", "US20120146835"], "inventors": ["Volker Gross, ", "Wolf Steffens, ", "Stephan Leinbaum, ", "Goetz Kuehnle, ", "Andre Treptow"]},
{"international_classification": ["G08G1/04"], "us_classification": "", "reference": ["US5884212", "US7038577", "US7085637", "US7593838", "US7991550", "US8046166", "US8055428", "US8073575", "US20060006988", "US20060152346", "US20100201508"], "title": "Method for detecting a traffic zone", "summary": "A method for detecting a traffic zone using an on-board sensor system. Objects from the surroundings of the host vehicle are detected using the sensor system. The course of the traffic lanes is derived from the performance characteristics of the objects detected by the sensors.", "assignee": ["Martin Staempfle, ", "Jan-Carsten Becker"], "publication_date": "31 dc. 2009", "id": "US20090326752", "referenced_by": ["US8305444", "US8521363", "US8682500", "US20100123778", "US20100152967", "US20110137488", "US20140207377"], "inventors": ["Martin Staempfle, ", "Jan-Carsten Becker"]},
{"international_classification": ["B60K23/04", "B60W30/18", "G06F17/00"], "us_classification": "", "reference": ["US4961476", "US20030146034", "US20060074530", "US20070185638"], "title": "Method for producing a differential torque acting on the vehicle wheels of a vehicle", "summary": "In a method for generating a differential torque in a vehicle, in the case in which the vehicle is in a load change state and simultaneously in an extreme driving situation, in which wheel torques of different magnitudes are present at the vehicle wheels, the torque distribution between the vehicle wheels is changed.", "assignee": ["Peter Van Vliet"], "publication_date": "23 fvr. 2012", "id": "US20120046842", "referenced_by": [], "inventors": ["Peter Van Vliet"]},
{"international_classification": ["G06F3/048", "B60N2/02"], "us_classification": "", "reference": ["US4811226", "US5506595", "US5825338", "US7084859", "US20020067366", "US20020167589", "US20050134479", "US20050138662", "US20050154505", "US20090005961"], "title": "Vehicular Heads-Up Display System", "summary": "Heads-up display arrangements for vehicles including a seat in which an occupant sits, a system for forming an image of text and/or graphics in a field of view of the occupant, a determination arrangement for determining a position of the occupant (or a part thereof) and an adjustment system for adjusting the seat based on the occupant's determined position to thereby change the orientation of the occupant relative to the image. Change of the orientation of the occupant relative to the image may entail adjusting the seat and/or adjusting the image forming system, which is often a heads-up display system. Adjustment of the seat may involve moving the seat forward or backward and/or up or down, or any other direction or way possible given the construction of the seat.", "assignee": ["Automotive Technologies International, Inc."], "publication_date": "6 nov. 2008", "id": "US20080276191", "referenced_by": ["US8103415", "US8734247", "US20090231303", "US20120200664", "US20130090816"], "inventors": ["David S. Breed"]},
{"international_classification": ["G06K9/40"], "us_classification": "", "reference": ["US4783840", "US6608942", "US7038810", "US7110455", "US7379615", "US8160301", "US8582032", "US20020076117", "US20100027905", "US20130089269"], "title": "Scene Adaptive Filter Design for Improved Stereo Matching", "summary": "A method is provided that includes generating coefficients of a scene adaptive filter (SAF) based on differences between values of neighboring pixels in a representative two dimensional (2D) image, and applying the SAF to a plurality of corresponding 2D images.", "assignee": ["Texas Instruments Incorporated"], "publication_date": "11 avr. 2013", "id": "US20130089269", "referenced_by": ["US8818125", "US20130083994", "US20130089269", "US20130308820"], "inventors": ["Peter Charles Barnum, ", "Goksel Dedeoglu"]},
{"international_classification": ["G06K9/20", "G06K9/00"], "us_classification": "", "reference": ["US6266442", "US6366213", "US6420975", "US6711474", "US7085637", "US7092548", "US7202776", "US7337055"], "title": "Driver assistance system for vehicle", "summary": "A driver assistance system for a vehicle includes a forward facing camera and a processor operable to process image data captured by the camera. Responsive to processing of captured image data, the driver assistance system is operable to determine a lane along which the vehicle is traveling and to detect oncoming vehicles approaching the vehicle in another lane that is to the right or left of the determined lane along which the vehicle is traveling. The driver assistance system is operable to control, at least in part, a light beam emanating from a headlamp of the vehicle and adjusts the light beam emanating from the headlamp to limit directing beam light towards the eyes of a driver of the detected oncoming vehicle. Responsive to processing of captured image data, the driver assistance system is operable to provide lane departure warning to a driver of the vehicle.", "assignee": ["Donnelly Corporation"], "publication_date": "13 mars 2014", "id": "US20140071285", "referenced_by": [], "inventors": ["Kenneth Schofield, ", "Niall R. Lynam"]},
{"international_classification": ["H04N5/335"], "us_classification": "", "reference": ["US6774988", "US20040201483", "US20070206110"], "title": "Camera set-up and method for ascertaining picture signals having color values", "summary": "A method for ascertaining image signals having color values and a camera set-up, which has: a camera having camera optics, an image sensor for recording an environment and for outputting first image signals, and a color mask applied in front of the image sensor, and an evaluation device, which picks up the first image signals emitted by the image sensor, the image sensor having a plurality of sensor pixels and the color mask having a plurality of filter pixels which are each situated in front of the sensor pixels and include first colored filter pixels and transparent filter pixels; and some of the sensor pixels picking up the light via the colored filter pixels and outputting the first color values, and additional sensor pixels picking up the light via the transparent filter pixels and outputting the intensity values. The evaluation device ascertains second color values from the intensity values and the first color values of various sensor pixels, and forms second image signals from the first color values and the second color values.", "assignee": ["Stephan Simon"], "publication_date": "26 aot 2010", "id": "US20100214455", "referenced_by": [], "inventors": ["Stephan Simon"]},
{"international_classification": ["G01C21/26", "B60W30/095"], "us_classification": "", "reference": ["US5991427", "US20090088966", "US20090195414", "US20100256852", "US20100289632", "US20110121993", "US20110190972", "US20120139775"], "title": "Method for determining a virtual vehicle corridor", "summary": "A method for assisting a vehicle driver, wherein a sensor for covering the surroundings covers a pavement in front of the vehicle in order to determine a virtual vehicle corridor for a road vehicle in a complex traffic situation and the virtual vehicle corridor is determined depending on identified traffic lines and raised pavement boundaries.", "assignee": ["Continental Teves Ag & Co. Ohg, ", "Conti Temic Microelectronic Gmbh"], "publication_date": "1 aot 2013", "id": "US20130197804", "referenced_by": [], "inventors": ["Stefan Lke, ", "Dirk Waldbauer, ", "Michael Darms, ", "Thomas Berthold, ", "Matthias Komar"]},
{"international_classification": ["H04W4/04", "H04W4/22"], "us_classification": "", "reference": [], "title": "Providing a user interface experience based on inferred vehicle state", "summary": "A mobile device is described herein that provides a user interface experience to a user who is operating the mobile device within a vehicle. The mobile device provides the user interface experience using mode functionality. The mode functionality operates by receiving inference-input information from one or more input sources. At least one input source corresponds to at least one movement-sensing device, provided by the mobile device, that determines movement of the mobile device. The mode functionality then infers a state of the vehicle based on the inference-input information and presents a user interface experience that is appropriate for the vehicle state. In one scenario, the mode functionality can also infer that the vehicle is in a distress condition. In response, the mode functionality can solicit assistance for the user.", "assignee": ["Microsoft Corporation"], "publication_date": "20 juin 2013", "id": "US20130157607", "referenced_by": ["US20120052907"], "inventors": ["Timothy S. Paek, ", "Paramvir Bahl, ", "Sreenivas Addagatla"]},
{"international_classification": ["G06K9/00", "B60Q1/08"], "us_classification": "", "reference": ["US6960005", "US8017898", "US8070329", "US8465187", "US8480270"], "title": "Method for Controlling a Headlamp System for a Vehicle, and Headlamp System", "summary": "In a method for controlling a headlamp system for a vehicle, the headlamp system having two headlamps, set apart from each other, road users are detected in front of the vehicle in the driving direction, and a first total light pattern is able to be produced, in which the illumination range on a first side of a center axis is greater than on the other, second side of this center axis, and a second total light pattern is able to be produced, in which the total light pattern is controllable such that it has an illumination range in the direction of at least one detected road user that is less than the distance to the detected road user, and which has an illumination range in another direction that is greater than the distance to the detected road user. During the switch from the first total light pattern to the second total light pattern, the illumination range of at least one headlamp on the first side of the center axis is first reduced to at least such an extent that it is less than the distance to the detected road user, the second total light pattern being produced subsequently.", "assignee": ["Karsten Dierks, ", "Martin Freese, ", "Bernd Jahrsau"], "publication_date": "11 juil. 2013", "id": "US20130177202", "referenced_by": [], "inventors": ["Karsten Dierks, ", "Martin Freese, ", "Bernd Jahrsau"]},
{"international_classification": ["B60Q9/00"], "us_classification": "", "reference": [], "title": "Method and system for supporting a driver of a vehicle in manoeuvring the vehicle on a driving route and portable communication device", "summary": "The invention relates to a method for supporting a driver of a vehicle (2) in manoeuvring the vehicle (2) on a driving route (4), in particular when parking a vehicle (2) into or out of a parking space (3), with the aid of a portable communication device (13). At least one vehicle external sensor device (11, 17) is provided which is arranged stationarily relative to the driving route (4). The sensor device (11, 17) captures data relating to the vehicle (2) located on the driving route (4) and wirelessly emits signals (15, 15) comprising the captured data in such a way that same signals (15, 15) reach the interior of the vehicle (2). The signals (15, 15) are received through the portable communication device (13), and the data are output through the portable communication device (13). The invention also relates to a system (10) as well as a portable communication device (13).", "assignee": ["Valeo Schalter Und Sensoren Gmbh"], "publication_date": "23 mai 2013", "id": "US20130127641", "referenced_by": [], "inventors": ["Xavier Groult, ", "Siav-Kuong Kuoch"]},
{"international_classification": ["B32B7/02", "B29C65/00"], "us_classification": "", "reference": [], "title": "Vehicle glazing, method for the production thereof, and use", "summary": "The present invention relates to a vehicle glazing, comprising at least:\n   a) at least one transparent pane (1), b) one transparent body (2), c) at least one transparent polymer layer (3) interposed between them,\n\nwherein the transparent body (2) is connected in a positively locking fashion to the transparent pane (1) via the transparent polymer layer (3) over at least one coupling surface and the maximum width and the maximum length of the transparent body is smaller than the minimum width and the minimum length of the transparent pane (1) and a transmission surface A2-p of the transparent body (2) and the surface A1 of the transparent pane (1), run parallel to each other with maximum angle deviations of less than 10. The transparent pane (1) has an opaque border of the transmission region with covering paint (10). To mount an image recorder and to minimize light scatter, the transparent body (2) has light-absorbing parts (5).\n    ", "assignee": ["Alwin Timmermann"], "publication_date": "17 nov. 2011", "id": "US20110281095", "referenced_by": [], "inventors": ["Alwin Timmermann"]},
{"international_classification": ["B62D25/20", "B62D65/02"], "us_classification": "", "reference": [], "title": "Floor Module for a Motor Vehicle with a Variable Driving Concept", "summary": "A floor module for a motor vehicle includes a floor shell, which can be fastened to a shell of the motor vehicle, and equipment with a plurality of variant-specific constructional units arranged on the floor shell. A method for assembling a floor module involves equipping a respective shell of the motor vehicle with a floor module with corresponding chassis and drive train.", "assignee": ["Daimler Ag"], "publication_date": "19 dc. 2013", "id": "US20130334839", "referenced_by": [], "inventors": ["Christoph Grevener, ", "Uwe Habisreitinger, ", "Andreas Krevet, ", "Matthias Mueller, ", "Thomas Stark, ", "Konrad Wirth, ", "Michael Zuern"]},
{"international_classification": ["G06F19/00"], "us_classification": "", "reference": ["US6134491", "US6679807"], "title": "Method for adjusting a steering system in a vehicle", "summary": "In a method for adjusting a steering system in a vehicle, a setpoint trajectory is produced to which a tolerance corridor is assigned, a basic steering torque for guiding the vehicle within the tolerance corridor being generated. In the event that the vehicle leaves the tolerance corridor, a steering guidance torque which acts upon the vehicle in the direction of the tolerance corridor is superimposed on the basic steering torque.", "assignee": ["Lutz Buerkle, ", "Michael Weilkes, ", "Tobias Rentschler"], "publication_date": "9 sept. 2010", "id": "US20100228438", "referenced_by": ["US8565975", "US8738231", "US20100185363", "US20120191301", "US20120265403", "US20130197762"], "inventors": ["Lutz Buerkle, ", "Michael Weilkes, ", "Tobias Rentschler"]},
{"international_classification": ["G01R27/04"], "us_classification": "", "reference": ["US5592170", "US6621448", "US7911324", "US20080129541", "US20130035901"], "title": "Method for detecting icing at an angle-resolving radar sensor in a driver assistance system for motor vehicles", "summary": "A method for detecting icing at an angle-resolving radar sensor in a driver assistance system for motor vehicles, in which signals of a plurality of antenna elements each having a specific angle characteristic are compared with the corresponding angle characteristics, and the azimuth angle of a located object is determined on the basis of an angle fit quality which indicates how well the signals of the antenna elements correspond to the angle characteristics for a given azimuth angle, wherein an indicator for icing is formed which is a monotonically falling function of the angle fit qualities of the located objects, with objects having a low signal-to-noise ratio being included in the indicator at the most with a reduced weighting.", "assignee": ["Stefan Heilmann, ", "Volker Gross, ", "Goetz Kuehnle, ", "Bechler Dirk"], "publication_date": "1 mars 2012", "id": "US20120049860", "referenced_by": [], "inventors": ["Stefan Heilmann, ", "Volker Gross, ", "Goetz Kuehnle, ", "Dirk BECHLER"]},
{"international_classification": ["G08B21/02", "B60W40/08"], "us_classification": "", "reference": ["US5835028", "US7295682", "US7411486", "US7463138", "US7772991", "US7825828", "US20040164851", "US20060132295", "US20070091173", "US20080258884", "US20090174536", "US20100002911", "US20100060486", "US20100066515", "US20110103650", "US20110196576"], "title": "Assistance system for a motor vehicle", "summary": "A driver-assistance system for a motor vehicle includes a recording device for recording an environment of the motor vehicle including a rear environment of the motor vehicle, a warning device for generating a warning signal, and an evaluation device. The evaluation device is configured to analyze a current driving behavior of the driver on the basis of the recorded environment of the motor vehicle, and to induce the warning device to generate a warning signal if the evaluation device detects a deviation of the driving behavior from a predetermined setpoint behavior.", "assignee": ["Wolfgang Niem"], "publication_date": "13 janv. 2011", "id": "US20110006903", "referenced_by": ["US8803694", "WO2013074868A1"], "inventors": ["Wolfgang Niem"]},
{"international_classification": ["G08B6/00"], "us_classification": "", "reference": ["US6347149", "US6382567", "US20030038776", "US20040008191", "US20070244641", "US20080231612", "US20080297475"], "title": "Operating control having specific feedback", "summary": "An operating control, in particular in a motor vehicle, wherein the operating control has at least one actuating element for actuating the operating control. The operating control comprises at least one sensor element operatively connected to the actuating element for registering an actuation, and at least one oscillator coil fixedly connected to the actuating element for emitting a mechanical feedback signal, in particular bending waves, through the actuating element. The feedback signal is haptically and/or acoustically perceivable, preferably simultaneously haptically and acoustically perceivable. The operating control includes controller element for activating the oscillator coil in case of actuation of the operating control.", "assignee": ["Drxlmaier GmbH"], "publication_date": "11 mars 2010", "id": "US20100060437", "referenced_by": ["EP2626875A1", "WO2012146269A1"], "inventors": ["Michael Steckel, ", "Karsten Ruter, ", "Raimund Kreis"]},
{"international_classification": ["B62D15/02", "B60T7/12"], "us_classification": "", "reference": [], "title": "Control Unit and Method for Driver Assistance", "summary": "A control unit for a driving assistance of a vehicle includes a data interface for querying sensors for detecting surroundings data of the vehicle, a data interface for querying a steering angle of the vehicle, an arithmetic unit for ascertaining driving instructions based on the surroundings data of the vehicle transmitted by the sensors, a data interface for outputting the driving instructions, the driving instructions including at least one instruction to perform a steering of the vehicle at a standstill, and an interface for activating a braking system of the vehicle in such a way that the vehicle is braked during the steering performed at a standstill until a predefined steering angle is reached.", "assignee": ["Peter Braegas"], "publication_date": "17 dc. 2009", "id": "US20090312912", "referenced_by": ["US8169341", "US8229664", "US20090271114", "US20110080305"], "inventors": ["Peter Braegas"]},
{"international_classification": ["G06F7/00", "G06F19/00", "G05D1/00"], "us_classification": "", "reference": ["US5435729", "US5669847", "US5752752", "US6173226", "US6226587", "US6304806", "US6339749", "US6347269", "US6438510", "US6446024", "US6498976", "US7818140", "US20030040861", "US20040006421", "US20040167705", "US20050010356", "US20050065695", "US20050272560", "US20060149424", "US20060178797", "US20060293815", "US20070038357", "US20080126009", "US20080186204", "US20090018732", "US20090125170", "US20090192760", "US20100121549", "US20100235039", "US20110015808", "US20110066322", "US20120022760", "US20120290187", "US20130138318"], "title": "System and method for estimating the mass of a vehicle", "summary": "A vehicle system and method that estimates or approximates the mass of a vehicle so that a more accurate vehicle mass estimate can be made available to other vehicle systems, such as an adaptive cruise control (ACC) system or an automated lane change (LCX) system. In an exemplary embodiment, the method compares an actual acceleration of the vehicle to an expected acceleration while the vehicle is under the control of an automated acceleration event. The difference between these two acceleration values, along with other potential input, may then be used to approximate the actual mass of the vehicle in a way that takes into account items such as passengers, cargo, fuel, etc. Once an accurate vehicle mass estimate is generated, the method may make this estimate available to other vehicle components, devices, modules, systems, etc. so that their performance can be improved.", "assignee": ["GM Global Technology Operations LLC"], "publication_date": "30 mai 2013", "id": "US20130138288", "referenced_by": [], "inventors": ["James N. Nickolaou, ", "Leonard J. Leshinsky, JR."]},
{"international_classification": ["B62D13/06"], "us_classification": "", "reference": ["US6959970", "US7088262", "DE19526702A1", "JPH101063A"], "title": "Drive Assisting Method for Reversal Path with Drawn Vehicle", "summary": "The invention relates to a drive assisting method for the reversal path of a vehicle which consists of a tow track and a trailer pivotable with respect thereto and is provided with a conventional mechanical steering device. The inventive method consists in selecting a target point (C), which the vehicle path should pass through, Determination in calculating the steering angle instruction 0 according to said target point (C) and the vehicle geometry and in displaying said steering angle instruction 0 in comparison with an actual steering angle , which corresponds to the position of the member (21) of the steering device, on a display device accessible to a driver.", "assignee": ["Renault Trucks"], "publication_date": "18 dc. 2008", "id": "US20080312792", "referenced_by": ["US8755984", "US8807261", "US8825328", "US20100156671"], "inventors": ["Francois Dechamp"]},
]