[
{"international_classification": ["G01S19/00", "B60R21/34"], "us_classification": "", "reference": ["US6243644", "US7019669", "US7663505", "US7739006", "US8081087", "US8538675", "US20030191577"], "title": "Communication based vehicle-pedestrian collision warning system", "summary": "A system for detecting a pedestrian is provided. The system includes a base and a mast extending from the base, and a plurality of sensors mounted on the mast, the plurality of sensors for detecting objects and pedestrians within a predetermined range, and wherein the sensors include a GPS antenna, at least one camera, an alert mechanism, a radio with an integrated directional antenna, and a short range communication antenna. A path predicting circuit is in communication with a system vehicle and the pedestrian detection system. The path predicting circuit processes information from the system vehicle and pedestrian detection system to predict the path of the system vehicle and detected objects. The path predicting circuit is in communication with a path collision circuit and the predicted paths are mapped on the path collision circuit so as to determine if the system vehicle may possibly collide with a detected object.", "assignee": ["Raytheon Company, ", "Toyota Motor Engineering & Manufacturing North America, Inc."], "publication_date": "26 sept. 2013", "id": "US20130253816", "referenced_by": ["US20130120158"], "inventors": ["Lorenzo Caminiti, ", "Jeffrey Clark LOVELL, ", "James Joseph Richardson, ", "Christopher Thomas Higgins"]},
{"international_classification": ["B60T7/22"], "us_classification": "", "reference": ["US3810520", "US6267194", "US6474753", "US7018004", "US7975798", "US8146703", "US8180531", "US8185273", "US8191667", "US20020112912", "US20090038873", "US20100300794", "US20110264347", "US20110264348", "US20120004819", "US20120083983", "US20120265418"], "title": "Method and Device for Autonomous Braking of a Vehicle Following Collision", "summary": "A method of controlling a vehicle braking system, includes: (i) detecting whether a collision has occurred; (ii) detecting whether a predetermined condition follows the collision; (iii) determining whether a driver has applied the brakes; and (iv) when a driver has not applied the brakes, autonomously initiating braking.", "assignee": ["Ford Global Technologies, Llc"], "publication_date": "26 sept. 2013", "id": "US20130253792", "referenced_by": ["US8670915", "US20130238211"], "inventors": ["Hassen Hammoud, ", "Jainbo Lu, ", "Gilberto Burgio, ", "Todd N. Clark, ", "Otto Hofmann, ", "Mohsen Lakehal-ayat, ", "Shweta M. Farmer, ", "Jason Shomsky, ", "Roland Schaefer"]},
{"international_classification": ["G06F7/00"], "us_classification": "", "reference": ["US6038496", "US20020179355", "US20090072972"], "title": "Method for increasing the safety of a vehicle and central processing unit for a driver assistance system", "summary": "A method is provided for increasing the safety of a vehicle, a region about the vehicle being scanned and a distance between at least one location on the vehicle and a physical limit of this region is measured in at least one direction. Subsequently, it is checked whether the distance exceeds a specifiable threshold value and finally, a warning signal is output and/or the vehicle is braked, if the result of the checking is positive. Moreover, a central processing unit for a corresponding driver assistance system and a driver assistance system are provided.", "assignee": ["Meike Fehse"], "publication_date": "26 juil. 2012", "id": "US20120191315", "referenced_by": [], "inventors": ["Meike Fehse"]},
{"international_classification": ["G05D1/00"], "us_classification": "", "reference": ["US8521364", "US20030150661", "US20090187313", "US20090259365", "US20100235053", "US20110054739", "US20110057813", "US20110080304", "US20110128140", "US20110260887", "US20120072067", "US20120287279", "US20130038715"], "title": "Method for Assisting a Driver of a Motor Vehicle", "summary": "A method for assisting a driver of a vehicle in a driving maneuver in which the vehicle is guided automatically along a previously calculated trajectory, or the lateral guidance for travel along the trajectory is carried out automatically, and after the driving maneuver is completed, the steering of the vehicle is returned to the driver, information being provided to the driver concerning the vehicle's surroundings and suitable steering settings before and/or during the transfer of the steering to the driver. Also described is a device for carrying out the method, including a steering arrangement for steering the vehicle along a previously calculated trajectory as well as an output arrangement for outputting information concerning the vehicle's surroundings and suitable steering settings to the driver before and/or during the transfer of the steering to the driver.", "assignee": ["Volker NIEMZ, ", "Andreas Gruetzmann"], "publication_date": "18 juil. 2013", "id": "US20130184925", "referenced_by": ["US20120173068", "US20140070934"], "inventors": ["Volker NIEMZ, ", "Andreas Gruetzmann"]},
{"international_classification": ["G06N5/02", "G06F7/00", "B60K31/00"], "us_classification": "", "reference": ["US8340883", "US20040030499", "US20080097699", "US20090076702", "US20100017180", "US20100036578", "US20100207762", "US20110071964", "US20110246156", "US20120083960"], "title": "Method and system for predicting movement behavior of a target traffic object", "summary": "A method for computationally predicting future movement behaviors of at least one target object can have the steps of\n   producing sensor data by at least one sensor physically sensing the environment of a host vehicle, and computing a plurality of movement behavior alternatives of a target object sensed by the sensor(s).    ", "assignee": ["Honda Research Institute Europe Gmbh"], "publication_date": "28 fvr. 2013", "id": "US20130054106", "referenced_by": ["US8788134", "US20130211689"], "inventors": ["Jens SCHMDDERICH, ", "Sven Rebhan"]},
]